**** HEADER AND TRAILER FOR AI DEBIT CARD FILE                      
 01  HEADER-RECORD-D.                                               
     05  HEADER-FIRST-PART-D        PIC X(26)                       
         VALUE 'HD  FTB PROCESSING DATE:  '.                        
     05  HEADER-PROCESS-DATE-D      PIC 9(9)    VALUE ZEROS.        
     05  HEADER-FILE-DESCRIPTION-D  PIC X(45)                       
         VALUE '5/3 CARD HOLDER MASTER - DEBIT CARD ACCOUNTS '.     
     05  FILLER                     PIC X(3598) VALUE SPACES.       
                                                                    
 01  TRAILER-RECORD-D.                                              
     05  TRAILER-FIRST-PART-D            PIC X(4)    VALUE 'TR  '.  
     05  TRAILER-RECORDS-OUT-D           PIC 9(9)    VALUE ZEROS.   
     05  FILLER                          PIC X(3665) VALUE SPACES.



     *----------------------------------------- DDEB ----------*                                                                    
     *  NAME:  ISCHDDEB             DATE WRITTEN:  09/07/2003  *                                                                     
     *                                                         *                                                                     
     *  CARD HOLDER MASTER EXTRACT FILE FOR AI - DEBIT  CARDS  *                                                                     
     *---------------------------------------------------------*                                                                     
                                                                                                                                     
      01  AI-CHD-EXTRACT-DEBIT.                                                                                                      
          05  AID-BASE-SEGMENT.                                                                                                      
              10  AID-FULL-ACCT-NO.                                                                                                  
                  15  AID-SYSTEM-BANK.                                                                                               
                      20  AID-SYSTEM-NO           PIC XXXX.                                                                          
                      20  AID-BANK-NO.                                                                                               
                          25  AID-PRIN-BANK       PIC XXXX.                                                                          
                          25  AID-AGENT-BANK      PIC XXXX.                                                                          
                  15  FILLER REDEFINES AID-SYSTEM-BANK.                                                                              
                      20  AID-SYSTEM-PRIN         PIC X(8).                                                                          
                      20  FILLER                  PIC XXXX.                                                                          
                  15  AID-ACCOUNT-NUMBER          PIC X(16).                                                                         
              10  AID-STATUS-BYTES.                                                                                                  
                  15  AID-RECORD-FORMAT           PIC S9V     COMP-3.                                                                
                  15  AID-STATUS-CODES.                                                                                              
                      20  AID-EXTERNAL-STATUS     PIC X.                                                                             
                      20  AID-INTERNAL-STATUS     PIC X.                                                                             
                  15  AID-GROSS-ACTIVE            PIC X.                                                                             
                  15  AID-DEBIT-ACTIVE            PIC X.                                                                             
                  15  AID-BASIC-ACTIVE            PIC X.                                                                             
                  15  AID-AUTH-FLAG               PIC X.                                                                             
                  15  AID-CREDIT-LIFE-FLAG        PIC X.                                                                             
                  15  AID-CHARGE-DDA-CODE         PIC X.                                                                             
                  15  AID-CYCLE-CODE              PIC XX.                                                                            
                  15  AID-CYCLE-CODE-99   REDEFINES  AID-CYCLE-CODE                                                                  
                                                  PIC 99.                                                                            
                  15  AID-INTEREST-SWITCH         PIC X.                                                                             
                  15  AID-REISSUE-CONTROL         PIC S9V.                                                                           
                  15  AID-RENEWAL-CODE            PIC S9V     COMP-3.                                                                
                  15  AID-SEX-CODE                PIC X.                                                                             
              10  AID-NAME-ADDR-SEGMENT.                                                                                             
                  15  AID-PRINCIPAL-NAME.                                                                                            
                      20  AID-SHORT-NAME.                                                                                            
                          25  AID-NAME-CHAR-1     PIC X.                                                                             
                          25  FILLER              PIC X(9).                                                                          
                      20  FILLER                  PIC X(16).                                                                         
                  15  FILLER   REDEFINES   AID-PRINCIPAL-NAME.                                                                       
                      20  AID-PRIN-NAME           PIC X(25).                                                                         
                      20  FILLER                  PIC X.                                                                             
                  15  AID-ADDR-LINE-1             PIC X(26).                                                                         
                  15  AID-ADDR-LINE-2             PIC X(26).                                                                         
                  15  AID-ZIP-CODE                PIC X(5).                                                                          
              10  AID-INTEREST-RATES            COMPUTATIONAL-3.                                                                     
                  15  AID-MONTHLY-RATE-CASH       PIC S9(5)V.                                                                        
                  15  AID-DAILY-RATE-CASH         PIC S9(5)V.                                                                        
                  15  AID-MONTHLY-RATE            PIC S9(5)V.                                                                        
                  15  AID-DAILY-RATE-MRCH         PIC S9(5)V.                                                                        
                  15  AID-DAILY-RATE-LOAN         PIC S9(5)V.                                                                        
              10  AID-INT-RATES-IN-PC REDEFINES  AID-INTEREST-RATES                                                                  
                                                COMPUTATIONAL-3.                                                                     
                  15  AID-MONTHLY-RATE-CASH-PC    PIC SV9(5).                                                                        
                  15  AID-DAILY-RATE-CASH-PC      PIC SVPP9(5).                                                                      
                  15  AID-MONTHLY-RATE-PC         PIC SV9(5).                                                                        
                  15  AID-DAILY-RATE-MRCH-PC      PIC SVPP9(5).                                                                      
                  15  AID-DAILY-RATE-LOAN-PC      PIC SVPP9(5).                                                                      
              10  AIDOLD-INTEREST-RATES        COMPUTATIONAL-3.                                                                      
                  15  AIDOLD-DAILY-RATE            PIC S9(5)V.                                                                       
                  15  AIDOLD-MONTHLY-RATE          PIC S9(5)V.                                                                       
              10  AIDOLD-INTS-IN-PC  REDEFINES                                                                                       
                  AIDOLD-INTEREST-RATES      COMPUTATIONAL-3.                                                                        
                  15  AIDOLD-DAILY-RATE-PC         PIC SVPP9(5).                                                                     
                  15  AIDOLD-MONTHLY-RATE-PC       PIC SV9(5).                                                                       
              10  AID-CUST-RELATIONSHIP           PIC X.                                                                             
              10  AID-RECOURSE-MERCHANT          PIC S9(5)V   COMP-3.                                                                
              10  AID-MISCELLANEOUS-CODES.                                                                                           
                  15  AID-NO-PLASTICS            PIC S9(3)V   COMP-3.                                                                
                  15  AID-CREDIT-LINE            PIC S9(7)V   COMP-3.                                                                
                  15  AID-OPEN-DATE              PIC S9(9)V   COMP-3.                                                                
                  15  AID-EXPIRATION-DATE        PIC S9(7)V   COMP-3.                                                                
                  15  AID-CR-LINE-DATE           PIC S9(9)V   COMP-3.                                                                
                  15  AID-CCI-INDICATOR           PIC X.                                                                             
                  15  AID-EMPLOYEE-FLAG           PIC X.                                                                             
                  15  AID-RATE-OPTION             PIC 99.                                                                            
              10  AID-LAST-RATE-AREA.                                                                                                
                  15  AID-LAST-RATE-DATE-JULIAN  PIC S9(7)    COMP-3.                                                                
                  15  AID-LAST-RATE-OPTION        PIC 99.                                                                            
                  15  AID-LAST-ANNUAL-CHARGE      PIC X.                                                                             
                  15  AID-LAST-INT-METHOD         PIC 99.                                                                            
              10  AID-SPECIAL-CODES.                                                                                                 
                  15  AID-SC-1                    PIC X.                                                                             
                  15  AID-SC-2                    PIC X.                                                                             
                  15  AID-SC-3                    PIC X.                                                                             
                  15  AID-SC-4                    PIC X.                                                                             
                  15  AID-SC-5                    PIC X.                                                                             
                  15  AID-SC-6                    PIC X.                                                                             
                  15  AID-SC-7                    PIC X.                                                                             
                  15  AID-SC-8                    PIC X.                                                                             
              10  AID-SPECIAL-CONTROL REDEFINES AID-SPECIAL-CODES                                                                    
                                          OCCURS 8 TIMES  PIC X.                                                                     
              10  AID-DATE-LAST-NONMON           PIC S9(9)V   COMP-3.                                                                
              10  AID-DATE-LAST-REVIEW           PIC S9(9)V   COMP-3.                                                                
              10  AID-DATE-NEXT-REVIEW           PIC S9(7)V   COMP-3.                                                                
              10  AID-NAME-ADDR-CHG              PIC S9V      COMP-3.                                                                
              10  AID-TYPE-CRED-LINE-CHG          PIC X.                                                                             
              10  AID-TYPE-PLASTIC                PIC X.                                                                             
              10  AID-COLLECTION-CODE             PIC 99.                                                                            
              10  AID-COFF-REASON-CODE            PIC 99.                                                                            
              10  AID-PAY-AHEAD-FLAG             PIC S9V      COMP-3.                                                                
              10  AID-NEWCARD-FLAG                PIC X.                                                                             
              10  AID-EXPANDED-NAME-ADDR.                                                                                            
                  15  AID-SPOUSE-NAME             PIC X(26).                                                                         
                  15  AID-CITY-STATE-LINE.                                                                                           
                      20  AID-CITY                PIC X(18).                                                                         
                      20  FILLER                  PIC X.                                                                             
                      20  AID-STATE               PIC XX.                                                                            
              10  AID-LOAN-FIXED-PAYMENT         PIC S9(9)V   COMP-3.                                                                
              10  AID-LOAN-FIXED-PAYMENT-PC         REDEFINES                                                                        
                  AID-LOAN-FIXED-PAYMENT         PIC S9(7)V99 COMP-3.                                                                
              10  AID-FIXED-PAYMENT-AMT          PIC S9(9)V   COMP-3.                                                                
              10  AID-FIXED-PAYMENT-AMT-PC          REDEFINES                                                                        
                  AID-FIXED-PAYMENT-AMT          PIC S9(7)V99 COMP-3.                                                                
              10  AID-REINSTATED-FLAG             PIC X.                                                                             
              10  AID-EXTRA-PRSNAL-DATA.                                                                                             
                  15  AID-DATE-OF-BIRTH          PIC S9(7)V   COMP-3.                                                                
                  15  AID-CREDIT-SCORE            PIC XX.                                                                            
                  15  AID-CR-SCORE-DATE          PIC S9(9)V   COMP-3.                                                                
                  15  AID-GIFT-ACTIVATION-DATE    REDEFINES                                                                          
                      AID-CR-SCORE-DATE          PIC S9(9)V   COMP-3.                                                                
                  15  AID-CHECKING-ACCT-NO        PIC X(10).                                                                         
                  15  AID-SAVINGS-ACCT-NO.                                                                                           
                      20  AID-CRED-ID             PIC X(6).                                                                          
                      20  AID-APPL-SRCE-ID        PIC S9(7)V   COMP-3.                                                               
                  15  AID-APPROVING-EMPLOYEE     PIC 9(7)     COMP-3.                                                                
                  15  AID-INT-METHOD              PIC 99.                                                                            
                  15  AID-SOC-SECURITY-NO        PIC S9(9)V   COMP-3.                                                                
                  15  AID-TELEPHONE-AREA-CODE.                                                                                       
                      20  AID-PHONE-AREA-CODE    PIC S9(3)V   COMP-3.                                                                
                      20  AID-TELEPHONE-NUMBER    PIC X(7).                                                                          
              10  AID-TRANSIT-ROUTING-NO         PIC S9(8)V   COMP-3.                                                                
              10  AID-STMT-HOLD-FLAG              PIC X.                                                                             
              10  AID-DELETE-FLAG                 PIC X.                                                                             
              10  AID-ANNUAL-CHARGE-FLAG          PIC X.                                                                             
              10  AID-SEGMENT-BYTE1               PIC X.                                                                             
              10  AID-SEGMENT-BYTE2               PIC X.                                                                             
              10  AID-BASE-VERSION                PIC X.                                                                             
              10  AID-BASE-OFFSET                 PIC 9(4)     COMP.                                                                 
              10  AID-CYCLES-AT-DELQ-RATE         PIC 9(2).                                                                          
              10  AID-PREV-EXTERNAL-STATUS        PIC X.                                                                             
              10  AID-PREV-DATE-STATUS-CHG       PIC S9(9)V   COMP-3.                                                                
              10  AID-TRANSFER-NEW-ACCT-NO        PIC X(16).                                                                         
              10  AID-TRANSFER-OLD-ACCT-NO        PIC X(16).                                                                         
              10  AID-LAST-NON-MON-TYPE           PIC X(3).                                                                          
              10  AID-LAST-CRD-REQ-DATE          PIC S9(9)V   COMP-3.                                                                
              10  AID-LAST-CRD-ISS-DATE          PIC S9(9)V   COMP-3.                                                                
              10  AID-LAST-ADDR-CHG-DATE         PIC S9(9)V   COMP-3.                                                                
              10  AID-AIRMILE-PROGRAM.                                                                                               
                  15  AID-AIRMILE-IND             PIC X.                                                                             
                  15  AID-AIRMILE-ENROLL         PIC S9(9)V   COMP-3.                                                                
                  15  AID-AIRMILE-CANCEL         PIC S9(9)V   COMP-3.                                                                
                  15  AID-AIRMILE-MTD-PTS        PIC S9(9)V   COMP-3.                                                                
                  15  AID-AIRMILE-PREV-PTS       PIC S9(9)V   COMP-3.                                                                
              10  AID-GIFT-MERCHANT-INFO          REDEFINES                                                                          
                  AID-AIRMILE-PROGRAM.                                                                                               
                  15  AID-GIFT-MERCHANT-NUMBER    PIC X(16).                                                                         
                  15  AID-GIFT-MERCHANT-CHAIN     PIC X(5).                                                                          
              10  AID-SKIPPAY-FLAG                PIC X.                                                                             
              10  AID-GIFT-MERCHANT-CHAIN2        REDEFINES                                                                          
                  AID-SKIPPAY-FLAG                PIC X.                                                                             
              10  AID-CARD-ACTIVATION-PROMO.                                                                                         
                  15  AID-CARD-ACTIVATION-1       PIC 9(4) COMP.                                                                     
                  15  AID-CARD-ACTIVATION-2       PIC 9(4) COMP.                                                                     
                  15  AID-CARD-ACTIVATION-3       PIC 9(4) COMP.                                                                     
                  15  AID-CARD-ACTIVATION-4       PIC 9(4) COMP.                                                                     
                  15  AID-CARD-ACTIVATION-5       PIC 9(4) COMP.                                                                     
              10  AID-GIFT-ISO-CODES              REDEFINES                                                                          
                  AID-CARD-ACTIVATION-PROMO.                                                                                         
                  15  AID-GIFT-ISO-LOC-COUNTRY    PIC X(2).                                                                          
                  15  AID-GIFT-ISO-LOC-REGION     PIC X(5).                                                                          
                  15  AID-GIFT-ISO-CURRENCY-TYPE  PIC X(3).                                                                          
              10  AID-BILL-PAY-TYPE               PIC X.                                                                             
              10  AID-PROMO-PRICING-IND                PIC X.                                                                        
              10  AID-CYCLES-AT-PROMO-RATE             PIC 9(2).                                                                     
              10  AID-PROMO-RATE-OPTION                PIC 9(2).                                                                     
              10  AID-XFER-INTEREST-RATES        COMPUTATIONAL-3.                                                                    
                  15  AID-MONTHLY-RATE-XFER            PIC S9(5)V.                                                                   
                  15  AID-MONTHLY-RATE-XFER-PC           REDEFINES                                                                   
                        AID-MONTHLY-RATE-XFER          PIC SV9(5).                                                                   
                  15  AID-DAILY-RATE-XFER              PIC S9(5)V.                                                                   
                  15  AID-DAILY-RATE-XFER-PC             REDEFINES                                                                   
                        AID-DAILY-RATE-XFER            PIC SVPP9(5).                                                                 
              10  AID-MRCH-PROMO-RATES               COMPUTATIONAL-3.                                                                
                  15  AID-MONTHLY-RATE-MRCH-PROMO      PIC S9(5)V.                                                                   
                  15  AID-MTHLY-RATE-MRCH-PROMO-R      REDEFINES                                                                     
                        AID-MONTHLY-RATE-MRCH-PROMO    PIC SV9(5).                                                                   
                  15  AID-DAILY-RATE-MRCH-PROMO        PIC S9(5)V.                                                                   
                  15  AID-DAILY-RATE-MRCH-PROMO-PC       REDEFINES                                                                   
                        AID-DAILY-RATE-MRCH-PROMO      PIC SVPP9(5).                                                                 
              10  AID-CASH-PROMO-RATES               COMPUTATIONAL-3.                                                                
                  15  AID-MONTHLY-RATE-CASH-PROMO      PIC S9(5)V.                                                                   
                  15  AID-MONTHLY-RATE-CASH-PROMO-R      REDEFINES                                                                   
                        AID-MONTHLY-RATE-CASH-PROMO    PIC SV9(5).                                                                   
                  15  AID-DAILY-RATE-CASH-PROMO        PIC S9(5)V.                                                                   
                  15  AID-DAILY-RATE-CASH-PROMO-PC       REDEFINES                                                                   
                        AID-DAILY-RATE-CASH-PROMO      PIC SVPP9(5).                                                                 
              10  AID-XFER-PROMO-RATES               COMPUTATIONAL-3.                                                                
                  15  AID-MONTHLY-RATE-XFER-PROMO      PIC S9(5)V.                                                                   
                  15  AID-MTHLY-RATE-XFER-PROMO-R      REDEFINES                                                                     
                        AID-MONTHLY-RATE-XFER-PROMO    PIC SV9(5).                                                                   
                  15  AID-DAILY-RATE-XFER-PROMO        PIC S9(5)V.                                                                   
                  15  AID-DAILY-RATE-XFER-PROMO-PC       REDEFINES                                                                   
                        AID-DAILY-RATE-XFER-PROMO      PIC SVPP9(5).                                                                 
              10  AID-OVERLMT-IND               PIC X.                                                                               
              10  AID-OVERLMT-DATE              PIC S9(9)V   COMP-3.                                                                 
              10  AID-SC-ORIG-APPL-SRCE-ID        PIC S9(7)V   COMP-3.                                                               
              10  AID-SC-ORIG-CREDIT-LINE        PIC S9(7)V   COMP-3.                                                                
              10  AID-SC-INTERNAL-SCORE           PIC X(3).                                                                          
              10  AID-SC-GUARANTOR-NAME           PIC X(26).                                                                         
              10  AID-SC-GUARANTOR-SSN           PIC S9(9)V   COMP-3.                                                                
              10  AID-SC-GUARANTOR-PHONE         PIC S9(10)V  COMP-3.                                                                
              10  AID-SC-GUARANTOR-ADDR1          PIC X(26).                                                                         
              10  AID-SC-GUARANTOR-ADDR2          PIC X(26).                                                                         
              10  AID-SC-GUARANTOR-CITY           PIC X(18).                                                                         
              10  AID-SC-GUARANTOR-STATE          PIC X(2).                                                                          
              10  AID-SC-GUARANTOR-ZIP            PIC 9(5).                                                                          
              10  AID-SC-WORK-PHONE              PIC S9(10)V  COMP-3.                                                                
              10  AID-LATE-PAYMENT-FLAG           PIC X.                                                                             
              10  AID-TYPE-OF-PLASTIC-CARD        PIC X(2).                                                                          
              10  AID-REWARDS-PROGRAM.                                                                                               
                  15  AID-REWARDS-IND             PIC X.                                                                             
                  15  AID-REWARDS-PGM-TYPE        PIC X(4).            PS080527                                                      
                  15  AID-REWARDS-FEE-AMT         PIC S9(2)V  COMP-3.                                                                
                  15  AID-REWARDS-MKT-CODE        PIC X(7).                                                                          
                  15  AID-REWARDS-BONUS-PTS       PIC S9(4)V  COMP-3.                                                                
                  15  AID-REWARDS-ENROLL          PIC S9(9)V  COMP-3.                                                                
                  15  AID-REWARDS-CANCEL          PIC S9(9)V  COMP-3.                                                                
              10  AID-CRLIFE-FIELDS.                                                                                                 
                  15  AID-CRLIFE-BILL-STATE       PIC X(2).                                                                          
                  15  AID-CRLIFE-ORIG-STATE       PIC X(2).                                                                          
              10  AID-MAIDEN-NAME                 PIC X(25).                                                                         
              10  AID-PROMO-ELIG-DATE             PIC S9(9)V COMP-3.                                                                 
              10  AID-PROMO-TARGET-FLAG           PIC X.                                                                             
              10  AID-GEFA-IDENTITY-TRACK.                                                                                           
                  15  AID-GEFA-STATUS-IND         PIC X(1).                                                                          
                  15  AID-GEFA-ENROLL-DATE        PIC S9(9)V COMP-3.                                                                 
                  15  AID-GEFA-CANCEL-DATE        PIC S9(9)V COMP-3.                                                                 
                  15  AID-GEFA-MKTG-CODE.                                                                                            
                      20  AID-GEFA-MKTG-MM        PIC X(2).                                                                          
                      20  AID-GEFA-MKTG-YY        PIC X(2).                                                                          
                      20  AID-GEFA-MKTG-CHANNEL   PIC X(1).                                                                          
                      20  AID-GEFA-MKTG-SEGMENT   PIC X(2).                                                                          
              10  AID-DO-NOT-SOLICIT.                                                                                                
                  15  AID-DO-NOT-CALL             PIC X(1).                                                                          
                  15  AID-DO-NOT-MAIL             PIC X(1).                                                                          
                  15  AID-DO-NOT-SHARE            PIC X(1).                                                                          
                  15  AID-DO-NOT-EMAIL            PIC X(1).                                                                          
              10  AID-ACCOUNT-RETENTION           PIC X(1).                                                                          
              10  FILLER.                                                                                                            
                  15  AID-FIRST6-ACCT-NUM         PIC X(6).                                                                          
                  15  AID-LAST4-ACCT-NUM          PIC X(4).                                                                          
              10  FILLER                           PIC X(144).                                                                       
                                                                                                                                     
                                                                                                                                     
          05  AID-HISTORY-SEGMENT.                                                                                                   
              10  AID-HISTORY-STATUS                  PIC X.                                                                         
              10  FILLER                              PIC X.                                                                         
              10  AID-HISTORY-SEGMENT-ID              PIC XX.                                                                        
              10  AID-HISTORY-LENGTH               PIC S9(3) COMP-3.                                                                 
              10  AIDHD-VIDEO-DISPLAY-HISTORY.                                                                                       
                  15  AIDHD-VD-NMO-ACT-GROSS      PIC S9(3)V COMP-3.                                                                 
                  15  AIDHD-VD-NMO-TOP-LINE       PIC S9(3)V COMP-3.                                                                 
                  15  AIDHD-VD-DELQ-HIST        COMPUTATIONAL-3.                                                                     
                      20  AIDHD-VD-NMO-DELIN      PIC S9(3)V.                                                                        
                      20  AIDHD-VD-NO-1CYC-DEL    PIC S9(3)V.                                                                        
                      20  AIDHD-VD-NO-2CYC-DEL    PIC S9(3)V.                                                                        
                      20  AIDHD-VD-NO-3CYC-DEL    PIC S9(3)V.                                                                        
                  15  AIDHD-VD-NMO-EARNINGS      PIC S9(3)V  COMP-3.                                                                 
                  15  AIDHD-VD-TOTAL-EARNINGS    PIC S9(11)V COMP-3.                                                                 
                  15  AIDHD-VD-TOTAL-EARNINGS-PC    REDEFINES                                                                        
                      AIDHD-VD-TOTAL-EARNINGS   PIC S9(9)V99 COMP-3.                                                                 
                  15  AIDHD-VD-HIGH-BALANCE     PIC S9(7)V   COMP-3.                                                                 
                  15  AIDHD-VD-HIGH-ARREARS     PIC S9(7)V   COMP-3.                                                                 
              10  AIDHD-PREVIOUS-YEAR           COMPUTATIONAL-3.                                                                     
                  15  AIDHD-PY-NET-NO-PURCH       PIC S9(3)V.                                                                        
                  15  AIDHD-PY-NET-NO-CASH        PIC S9(3)V.                                                                        
                  15  AIDHD-PY-NET-AMT-PURCH      PIC S9(13)V.                                                                       
                  15  AIDHD-PY-NET-AMT-PURCH-PC     REDEFINES                                                                        
                      AIDHD-PY-NET-AMT-PURCH      PIC S9(11)V99.                                                                     
                  15  AIDHD-PY-NET-AMT-CASH       PIC S9(13)V.                                                                       
                  15  AIDHD-PY-NET-AMT-CASH-PC      REDEFINES                                                                        
                      AIDHD-PY-NET-AMT-CASH       PIC S9(11)V99.                                                                     
                  15  AIDHD-PY-NMO-ACT-GROSS      PIC S9(3)V.                                                                        
                  15  AIDHD-PY-NMO-TOP-LINE       PIC S9(3)V.                                                                        
                  15  AIDHD-PY-DELQ-HIST.                                                                                            
                      20  AIDHD-PY-NMO-DELIN      PIC S9(3)V.                                                                        
                      20  AIDHD-PY-NO-1CYC-DEL    PIC S9(3)V.                                                                        
                      20  AIDHD-PY-NO-2CYC-DEL    PIC S9(3)V.                                                                        
                      20  AIDHD-PY-NO-3CYC-DEL    PIC S9(3)V.                                                                        
                  15  AIDHD-PY-NMO-EARNINGS       PIC S9(3)V.                                                                        
                  15  AIDHD-PY-TOTAL-EARNINGS     PIC S9(9)V.                                                                        
                  15  AIDHD-PY-TOTAL-EARNINGS-PC    REDEFINES                                                                        
                      AIDHD-PY-TOTAL-EARNINGS     PIC S9(7)V99.                                                                      
                  15  AIDHD-PY-HIGH-BALANCE       PIC S9(7)V.                                                                        
                  15  AIDHD-PY-HIGH-ARREARS       PIC S9(7)V.                                                                        
                  15  AIDHD-PY-NO-LOAN            PIC S9(3)V.                                                                        
                  15  AIDHD-PY-AMT-LOAN           PIC S9(13)V.                                                                       
                  15  AIDHD-PY-AMT-LOAN-PC          REDEFINES                                                                        
                      AIDHD-PY-AMT-LOAN           PIC S9(11)V99.                                                                     
              10  AIDHD-YEAR-TO-DATE            COMPUTATIONAL-3.                                                                     
                  15  AIDHD-YTD-NET-NO-PURCH      PIC S9(3)V.                                                                        
                  15  AIDHD-YTD-NET-NO-CASH       PIC S9(3)V.                                                                        
                  15  AIDHD-YTD-NET-AMT-PURCH     PIC S9(13)V.                                                                       
                  15  AIDHD-YTD-NET-AMT-PURCH-PC    REDEFINES                                                                        
                      AIDHD-YTD-NET-AMT-PURCH     PIC S9(11)V99.                                                                     
                  15  AIDHD-YTD-NET-AMT-CASH      PIC S9(13)V.                                                                       
                  15  AIDHD-YTD-NET-AMT-CASH-PC     REDEFINES                                                                        
                      AIDHD-YTD-NET-AMT-CASH      PIC S9(11)V99.                                                                     
                  15  AIDHD-YTD-NMO-ACT-GROSS     PIC S9(3)V.                                                                        
                  15  AIDHD-YTD-NMO-TOP-LINE      PIC S9(3)V.                                                                        
                  15  AIDHD-YTD-DELQ-HIST.                                                                                           
                      20  AIDHD-YTD-NMO-DELIN     PIC S9(3)V.                                                                        
                      20  AIDHD-YTD-NO-1CYC-DEL   PIC S9(3)V.                                                                        
                      20  AIDHD-YTD-NO-2CYC-DEL   PIC S9(3)V.                                                                        
                      20  AIDHD-YTD-NO-3CYC-DEL   PIC S9(3)V.                                                                        
                  15  AIDHD-YTD-NMO-EARNINGS      PIC S9(3)V.                                                                        
                  15  AIDHD-YTD-HIGH-BALANCE      PIC S9(7)V.                                                                        
                  15  AIDHD-YTD-HIGH-ARREARS      PIC S9(7)V.                                                                        
                  15  AIDHD-YTD-NO-LOAN           PIC S9(3)V.                                                                        
                  15  AIDHD-YTD-AMT-LOAN          PIC S9(13)V.                                                                       
                  15  AIDHD-YTD-AMT-LOAN-PC         REDEFINES                                                                        
                      AIDHD-YTD-AMT-LOAN          PIC S9(11)V99.                                                                     
                  15  AIDHD-YTD-BILLED-CASH-INT   PIC S9(9)V.                                                                        
                  15  AIDHD-YTD-BILL-CASH-INT-PC  REDEFINES                                                                          
                      AIDHD-YTD-BILLED-CASH-INT   PIC S9(7)V99.                                                                      
                  15  AIDHD-YTD-BILLED-SVC-CHG    PIC S9(9)V.                                                                        
                  15  AIDHD-YTD-BILLED-SVC-CHG-PC   REDEFINES                                                                        
                      AIDHD-YTD-BILLED-SVC-CHG    PIC S9(7)V99.                                                                      
                  15  AIDHD-YTD-BILLED-MRCH-INT   PIC S9(9)V.                                                                        
                  15  AIDHD-YTD-BILL-MRCH-INT-PC  REDEFINES                                                                          
                      AIDHD-YTD-BILLED-MRCH-INT   PIC S9(7)V99.                                                                      
                  15  AIDHD-YTD-BILLED-CR-LIFE    PIC S9(9)V.                                                                        
                  15  AIDHD-YTD-BILLED-CR-LIFE-PC   REDEFINES                                                                        
                      AIDHD-YTD-BILLED-CR-LIFE    PIC S9(7)V99.                                                                      
                  15  AIDHD-YTD-BILLED-LOAN-INT   PIC S9(9)V.                                                                        
                  15  AIDHD-YTD-BILL-LOAN-INT-PC  REDEFINES                                                                          
                      AIDHD-YTD-BILLED-LOAN-INT   PIC S9(7)V99.                                                                      
                  15  AIDHD-YTD-BILLED-LATE-CHG   PIC S9(9)V.                                                                        
                  15  AIDHD-YTD-BILL-LATE-CHG-PC  REDEFINES                                                                          
                      AIDHD-YTD-BILLED-LATE-CHG   PIC S9(7)V99.                                                                      
                  15  AIDHD-YTD-BILLED-ITEM-CHG   PIC S9(9)V.                                                                        
                  15  AIDHD-YTD-BILL-ITEM-CHG-PC  REDEFINES                                                                          
                      AIDHD-YTD-BILLED-ITEM-CHG   PIC S9(7)V99.                                                                      
              10  AIDHD-LAST-TRAN-DATA.                                                                                              
                  15  AID-TYPE-LAST-MON-TRAN      PIC X.                                                                             
                  15  AID-DATE-LAST-MON-TRAN     PIC S9(9)V   COMP-3.                                                                
                  15  AID-DATE-LAST-PAYMENT      PIC S9(9)V   COMP-3.                                                                
                  15  AID-DATE-LAST-GIFT-ACTIVITY REDEFINES                                                                          
                      AID-DATE-LAST-PAYMENT      PIC S9(9)V   COMP-3.                                                                
                  15  AID-DATE-LAST-STMT         PIC S9(9)V   COMP-3.                                                                
                  15  AID-DATE-FIRST-ACT         PIC S9(9)V   COMP-3.                                                                
                  15  AID-DATE-STATUS-CHG        PIC S9(9)V   COMP-3.                                                                
                  15  AID-AMT-LAST-PAYMENT       PIC S9(9)V   COMP-3.                                                                
                  15  AID-AMT-LAST-PAYMENT-PC       REDEFINES                                                                        
                      AID-AMT-LAST-PAYMENT       PIC S9(7)V99 COMP-3.                                                                
                  15  AID-DATE-PREV-STMT         PIC S9(9)V   COMP-3.                                                                
                  15  AID-CHGOFF-INDIC           PIC S9(3)V   COMP-3.                                                                
                  15  AID-HIST-LS-BAL            PIC S9(9)V   COMP-3.                                                                
                  15  AID-HIST-LS-BAL-PC            REDEFINES                                                                        
                      AID-HIST-LS-BAL            PIC S9(7)V99 COMP-3.                                                                
                  15  AID-HIST-LS-RC-BAL         PIC S9(9)V   COMP-3.                                                                
                  15  AID-HIST-LS-RC-BAL-PC         REDEFINES                                                                        
                      AID-HIST-LS-RC-BAL         PIC S9(7)V99 COMP-3.                                                                
                  15  AID-HIST-LS-IL-BAL         PIC S9(9)V   COMP-3.                                                                
                  15  AID-HIST-LS-IL-BAL-PC         REDEFINES                                                                        
                      AID-HIST-LS-IL-BAL         PIC S9(7)V99 COMP-3.                                                                
              10  AID-BONUS-BUCKS-TOT            PIC S9(7)V   COMP-3.                                                                
              10  FILLER                          PIC X.                                                                             
              10  AID-CURR-NO-REAGED             PIC S9(3)V   COMP-3.                                                                
              10  AID-LAST-NO-REAGED             PIC S9(3)V   COMP-3.                                                                
              10  AID-PREV-NO-REAGED             PIC S9(3)V   COMP-3.                                                                
              10  AIDHD-LY-END-UNPAID-INT       PIC S9(9)V   COMP-3.                                                                 
              10  AIDHD-LY-END-UNPAID-INT-PC       REDEFINES                                                                         
                  AIDHD-LY-END-UNPAID-INT       PIC S9(7)V99 COMP-3.                                                                 
              10  AIDHD-PY-END-UNPAID-INT       PIC S9(9)V   COMP-3.                                                                 
              10  AIDHD-PY-END-UNPAID-INT-PC       REDEFINES                                                                         
                  AIDHD-PY-END-UNPAID-INT       PIC S9(7)V99 COMP-3.                                                                 
              10  AID-PAYMENT-HISTORY-PROFILE     PIC X(24).                                                                         
              10  AIDHD-XFER-HISTORY-DATA       COMPUTATIONAL-3.                                                                     
                  15  AIDHD-PY-NET-NO-XFER-PUR    PIC S9(3)V.                                                                        
                  15  AIDHD-PY-NET-AMT-XFER-PUR   PIC S9(13)V.                                                                       
                  15  AIDHD-PY-NET-AMT-XFER-PUR-PC  REDEFINES                                                                        
                       AIDHD-PY-NET-AMT-XFER-PUR  PIC S9(11)V99.                                                                     
                  15  AIDHD-YTD-NET-NO-XFER-PUR   PIC S9(3)V.                                                                        
                  15  AIDHD-YTD-NET-AMT-XFER-PUR  PIC S9(13)V.                                                                       
                  15  AIDHD-YTD-NET-AMT-XFER-PUR-PC REDEFINES                                                                        
                        AIDHD-YTD-NET-AMT-XFER-PUR PIC S9(11)V99.                                                                    
                  15  AIDHD-YTD-BIL-XFER-MRH-INT   PIC S9(9)V.                                                                       
                  15  AIDHD-YTD-BIL-XFER-MRH-INT-PC  REDEFINES                                                                       
                       AIDHD-YTD-BIL-XFER-MRH-INT  PIC S9(7)V99.                                                                     
              10  AID-CURR-MTD-TRAN-HISTORY     COMPUTATIONAL-3.                                                                     
                  15  AID-CURR-MTD-NO-SALE        PIC S9(3)V.                                                                        
                  15  AID-CURR-MTD-NO-CASH        PIC S9(3)V.                                                                        
                  15  AID-CURR-MTD-NO-RETURN      PIC S9(3)V.                                                                        
                  15  AID-CURR-MTD-AMOUNTS.                                                                                          
                      20  AID-CURR-MTD-AMT-SALE   PIC S9(9)V.                                                                        
                      20  AID-CURR-MTD-AMT-CASH   PIC S9(9)V.                                                                        
                      20  AID-CURR-MTD-AMT-RETURN PIC S9(9)V.                                                                        
                  15  AID-CURR-MTD-AMOUNTS-PC      REDEFINES                                                                         
                          AID-CURR-MTD-AMOUNTS.                                                                                      
                      20  AID-CURR-MTD-AMT-SALE-PC   PIC S9(7)V99.                                                                   
                      20  AID-CURR-MTD-AMT-CASH-PC   PIC S9(7)V99.                                                                   
                      20  AID-CURR-MTD-AMT-RETURN-PC PIC S9(7)V99.                                                                   
              10  AID-LAST-MTD-TRAN-HISTORY     COMPUTATIONAL-3.                                                                     
                  15  AID-LAST-MTD-NO-SALE        PIC S9(3)V.                                                                        
                  15  AID-LAST-MTD-NO-CASH        PIC S9(3)V.                                                                        
                  15  AID-LAST-MTD-NO-RETURN      PIC S9(3)V.                                                                        
                  15  AID-LAST-MTD-AMOUNTS.                                                                                          
                      20  AID-LAST-MTD-AMT-SALE   PIC S9(9)V.                                                                        
                      20  AID-LAST-MTD-AMT-CASH   PIC S9(9)V.                                                                        
                      20  AID-LAST-MTD-AMT-RETURN PIC S9(9)V.                                                                        
                  15  AID-LAST-MTD-AMOUNTS-PC      REDEFINES                                                                         
                          AID-LAST-MTD-AMOUNTS.                                                                                      
                      20  AID-LAST-MTD-AMT-SALE-PC   PIC S9(7)V99.                                                                   
                      20  AID-LAST-MTD-AMT-CASH-PC   PIC S9(7)V99.                                                                   
                      20  AID-LAST-MTD-AMT-RETURN-PC PIC S9(7)V99.                                                                   
              10  AID-PREV-MTD-TRAN-HISTORY     COMPUTATIONAL-3.                                                                     
                  15  AID-PREV-MTD-NO-SALE        PIC S9(3)V.                                                                        
                  15  AID-PREV-MTD-NO-CASH        PIC S9(3)V.                                                                        
                  15  AID-PREV-MTD-NO-RETURN      PIC S9(3)V.                                                                        
                  15  AID-PREV-MTD-AMOUNTS.                                                                                          
                      20  AID-PREV-MTD-AMT-SALE   PIC S9(9)V.                                                                        
                      20  AID-PREV-MTD-AMT-CASH   PIC S9(9)V.                                                                        
                      20  AID-PREV-MTD-AMT-RETURN PIC S9(9)V.                                                                        
                  15  AID-PREV-MTD-AMOUNTS-PC      REDEFINES                                                                         
                          AID-PREV-MTD-AMOUNTS.                                                                                      
                      20  AID-PREV-MTD-AMT-SALE-PC   PIC S9(7)V99.                                                                   
                      20  AID-PREV-MTD-AMT-CASH-PC   PIC S9(7)V99.                                                                   
                      20  AID-PREV-MTD-AMT-RETURN-PC PIC S9(7)V99.                                                                   
              10  AID-FOUR-MTD-TRAN-HISTORY     COMPUTATIONAL-3.                                                                     
                  15  AID-FOUR-MTD-NO-SALE        PIC S9(3)V.                                                                        
                  15  AID-FOUR-MTD-NO-CASH        PIC S9(3)V.                                                                        
                  15  AID-FOUR-MTD-NO-RETURN      PIC S9(3)V.                                                                        
                  15  AID-FOUR-MTD-AMOUNTS.                                                                                          
                      20  AID-FOUR-MTD-AMT-SALE   PIC S9(9)V.                                                                        
                      20  AID-FOUR-MTD-AMT-CASH   PIC S9(9)V.                                                                        
                      20  AID-FOUR-MTD-AMT-RETURN PIC S9(9)V.                                                                        
                  15  AID-FOUR-MTD-AMOUNTS-PC      REDEFINES                                                                         
                          AID-FOUR-MTD-AMOUNTS.                                                                                      
                      20  AID-FOUR-MTD-AMT-SALE-PC   PIC S9(7)V99.                                                                   
                      20  AID-FOUR-MTD-AMT-CASH-PC   PIC S9(7)V99.                                                                   
                      20  AID-FOUR-MTD-AMT-RETURN-PC PIC S9(7)V99.                                                                   
              10  AIDHD-HIGH-PURCH                PIC S9(7)V COMP-3.                                                                 
              10  AIDHD-HIGH-CASH-ADV             PIC S9(7)V COMP-3.                                                                 
              10  AID-CURR-MTD-POST-HISTORY     COMPUTATIONAL-3.                                                                     
                  15  AID-CURR-MTD-NO-PST-SALE        PIC S9(3)V.                                                                    
                  15  AID-CURR-MTD-NO-PST-CASH        PIC S9(3)V.                                                                    
                  15  AID-CURR-MTD-NO-PST-RETURN      PIC S9(3)V.                                                                    
                  15  AID-CURR-MTD-PST-AMOUNTS.                                                                                      
                      20  AID-CURR-MTD-AMT-PST-SALE   PIC S9(9)V.                                                                    
                      20  AID-CURR-MTD-AMT-PST-CASH   PIC S9(9)V.                                                                    
                      20  AID-CURR-MTD-AMT-PST-RETURN PIC S9(9)V.                                                                    
                  15  AID-CURR-MTD-AMOUNTS-PST-PC      REDEFINES                                                                     
                          AID-CURR-MTD-PST-AMOUNTS.                                                                                  
                      20  AID-CURR-MTD-AMT-SALE-PST-PC  PIC S9(7)V99.                                                                
                      20  AID-CURR-MTD-AMT-CASH-PST-PC  PIC S9(7)V99.                                                                
                      20  AID-CURR-MTD-AMT-RETURN-PST-P PIC S9(7)V99.                                                                
              10  AID-LAST-MTD-POST-HISTORY     COMPUTATIONAL-3.                                                                     
                  15  AID-LAST-MTD-NO-PST-SALE        PIC S9(3)V.                                                                    
                  15  AID-LAST-MTD-NO-PST-CASH        PIC S9(3)V.                                                                    
                  15  AID-LAST-MTD-NO-PST-RETURN      PIC S9(3)V.                                                                    
                  15  AID-LAST-MTD-PST-AMOUNTS.                                                                                      
                      20  AID-LAST-MTD-AMT-PST-SALE   PIC S9(9)V.                                                                    
                      20  AID-LAST-MTD-AMT-PST-CASH   PIC S9(9)V.                                                                    
                      20  AID-LAST-MTD-AMT-PST-RETURN PIC S9(9)V.                                                                    
                  15  AID-LAST-MTD-AMOUNTS-PST-PC      REDEFINES                                                                     
                          AID-LAST-MTD-PST-AMOUNTS.                                                                                  
                      20  AID-LAST-MTD-AMT-SALE-PST-PC  PIC S9(7)V99.                                                                
                      20  AID-LAST-MTD-AMT-CASH-PST-PC  PIC S9(7)V99.                                                                
                      20  AID-LAST-MTD-AMT-RETURN-PST-P PIC S9(7)V99.                                                                
              10  AIDHD-PREVIOUS-YEAR-TRANSFER      COMPUTATIONAL-3.                                                                 
                  15  AIDHD-PY-NET-NO-XFER-CSH           PIC S9(3)V.                                                                 
                  15  AIDHD-PY-NET-AMT-XFER-CSH         PIC S9(13)V.                                                                 
                  15  AIDHD-PY-NET-AMT-XFER-CSH-PC         REDEFINES                                                                 
                        AIDHD-PY-NET-AMT-XFER-CSH     PIC S9(11)V99.                                                                 
              10  AIDHD-YEAR-TO-DATE-TRANSFER       COMPUTATIONAL-3.                                                                 
                  15  AIDHD-YTD-NET-NO-XFER-CSH          PIC S9(3)V.                                                                 
                  15  AIDHD-YTD-NET-AMT-XFER-CSH        PIC S9(13)V.                                                                 
                  15  AIDHD-YTD-NET-AMT-XFER-CSH-PC        REDEFINES                                                                 
                        AIDHD-YTD-NET-AMT-XFER-CSH    PIC S9(11)V99.                                                                 
                  15  AIDHD-YTD-BIL-XFER-CSH-INT         PIC S9(9)V.                                                                 
                  15  AIDHD-YTD-BIL-XFER-CSH-INT-PC        REDEFINES                                                                 
                        AIDHD-YTD-BIL-XFER-CSH-INT     PIC S9(7)V99.                                                                 
              10  AIDHD-YEAR-TO-DATE-PROMO          COMPUTATIONAL-3.                                                                 
                  15  AIDHD-YTD-BIL-PROMO-MRH-INT        PIC S9(9)V.                                                                 
                  15  AIDHD-YTD-BIL-PROMO-MRH-INT-R        REDEFINES                                                                 
                        AIDHD-YTD-BIL-PROMO-MRH-INT    PIC S9(7)V99.                                                                 
                  15  AIDHD-YTD-BIL-PROMO-CSH-INT        PIC S9(9)V.                                                                 
                  15  AIDHD-YTD-BIL-PROMO-CSH-INT-R        REDEFINES                                                                 
                        AIDHD-YTD-BIL-PROMO-CSH-INT    PIC S9(7)V99.                                                                 
                  15  AIDHD-YTD-BIL-PROMO-XFR-MIN        PIC S9(9)V.                                                                 
                  15  AIDHD-YTD-BIL-PROMO-XFR-MIN-R       REDEFINES                                                                  
                        AIDHD-YTD-BIL-PROMO-XFR-MIN    PIC S9(7)V99.                                                                 
                  15  AIDHD-YTD-BIL-PROMO-XFR-CIN        PIC S9(9)V.                                                                 
                  15  AIDHD-YTD-BIL-PROMO-XFR-CIN-R        REDEFINES                                                                 
                        AIDHD-YTD-BIL-PROMO-XFR-CIN    PIC S9(7)V99.                                                                 
              10  AID-LAST-STATEMENT-PROMO           COMPUTATIONAL-3.                                                                
                  15  AID-HIST-LS-PROMO-BAL              PIC S9(9)V.                                                                 
                  15  AID-HIST-LS-PROMO-BAL-PC             REDEFINES                                                                 
                        AID-HIST-LS-PROMO-BAL           PIC S9(7)V99.                                                                
              10  AID-LAST-REAGE-DATE              PIC S9(9)V COMP-3.                                                                
              10  FILLER                                 PIC X(256).                                                                 
                                                                                                                                     
                                                                                                                                     
          05  AID-ACTIVITY-SEGMENT.                                                                                                  
              10  AID-ACTIVITY-STATUS              PIC X.                                                                            
              10  FILLER                           PIC X.                                                                            
              10  AID-ACTIVITY-SEGMENT-ID          PIC XX.                                                                           
              10  AID-ACTIVITY-LENGTH             PIC S9(3)   COMP-3.                                                                
              10  AID-CURR-CTD-ACTIVITY.                                                                                             
                  15  AID-CURRENT-BALANCE         PIC S9(11)V COMP-3.                                                                
                  15  AID-CURR-BAL-DOLLAR-CENTS                                                                                      
                                REDEFINES   AID-CURRENT-BALANCE                                                                      
                                                PIC S9(7)V9(4) COMP-3.                                                               
                  15  AID-CURR-BAL-100                                                                                               
                                REDEFINES   AID-CURR-BAL-DOLLAR-CENTS                                                                
                                                  PIC S9(9)V99 COMP-3.                                                               
                  15  AID-CURR-RC-BAL             PIC S9(11)V COMP-3.                                                                
                  15  AID-CURR-RC-BAL-DC                                                                                             
                                REDEFINES   AID-CURR-RC-BAL                                                                          
                                                PIC S9(7)V9(4) COMP-3.                                                               
                  15  AID-CURR-RC-BAL-100                                                                                            
                                REDEFINES   AID-CURR-RC-BAL-DC                                                                       
                                                  PIC S9(9)V99  COMP-3.                                                              
                  15  AID-CURR-IL-BAL             PIC S9(11)V COMP-3.                                                                
                  15  AID-CURR-IL-BAL-DC                                                                                             
                                REDEFINES   AID-CURR-IL-BAL                                                                          
                                                PIC S9(7)V9(4)  COMP-3.                                                              
                  15  AID-CURR-IL-BAL-100                                                                                            
                                REDEFINES   AID-CURR-IL-BAL-DC                                                                       
                                                  PIC S9(9)V99  COMP-3.                                                              
                  15  AID-OVERPAYMENT-AMT         PIC S9(9)V  COMP-3.                                                                
                  15  AID-OVERPAYMENT-AMT-PC                                                                                         
                                REDEFINES   AID-OVERPAYMENT-AMT                                                                      
                                                  PIC S9(7)V99  COMP-3.                                                              
                  15  AID-CYCLE-TO-DATE-DATA         COMPUTATIONAL-3.                                                                
                      20  AID-CTD-COUNTS-AMTS.                                                                                       
                          25  AID-CTD-NO-SALE             PIC S9(3)V.                                                                
                          25  AID-CTD-NO-CASH             PIC S9(3)V.                                                                
                          25  AID-CTD-NO-RETURN           PIC S9(3)V.                                                                
                          25  AID-CTD-NO-PAYMENT          PIC S9(3)V.                                                                
                          25  AID-CTD-NO-LOAN             PIC S9(3)V.                                                                
                          25  AID-CTD-NO-ADJ              PIC S9(3)V.                                                                
                          25  AID-CTD-AMOUNTS.                                                                                       
                              30  AID-CTD-AMT-SALE       PIC S9(11)V.                                                                
                              30  AID-CTD-AMT-CASH       PIC S9(11)V.                                                                
                              30  AID-CTD-AMT-RETURN     PIC S9(11)V.                                                                
                              30  AID-CTD-AMT-PAYMENT    PIC S9(11)V.                                                                
                              30  AID-CTD-AMT-LOAN       PIC S9(11)V.                                                                
                          25  AID-CTD-AMOUNTS-PC        REDEFINES                                                                    
                                AID-CTD-AMOUNTS.                                                                                     
                              30  AID-CTD-AMT-SALE-PC   PIC S9(9)V99.                                                                
                              30  AID-CTD-AMT-CASH-PC   PIC S9(9)V99.                                                                
                              30  AID-CTD-AMT-RETURN-PC PIC S9(9)V99.                                                                
                              30 AID-CTD-AMT-PAYMENT-PC PIC S9(9)V99.                                                                
                              30  AID-CTD-AMT-LOAN-PC   PIC S9(9)V99.                                                                
                      20  AID-CTD-UNPAID-BPDS.                                                                                       
                          25  AID-CTD-UNPAID-RC-BPD       PIC S9(9)V.                                                                
                          25  AID-CTD-UNPAID-IL-BPD       PIC S9(9)V.                                                                
                          25  AID-CTD-PAY-AHEAD-AMT       PIC S9(9)V.                                                                
                      20  AID-CTD-UNPAID-BPDS-PC        REDEFINES                                                                    
                              AID-CTD-UNPAID-BPDS.                                                                                   
                          25  AID-CTD-UNPAID-RC-BPD-PC  PIC S9(7)V99.                                                                
                          25  AID-CTD-UNPAID-IL-BPD-PC  PIC S9(7)V99.                                                                
                          25  AID-CTD-PAY-AHEAD-AMT-PC  PIC S9(7)V99.                                                                
                  15  AID-CTD-CHARGES.                                                                                               
                      20  AID-CTD-AMT-LATE-CHG    PIC S9(9)V  COMP-3.                                                                
                      20  AID-CTD-AMT-ITEM-CHG    PIC S9(9)V  COMP-3.                                                                
                      20  AID-CTD-DEF-AVE-BAL     PIC S9(9)V  COMP-3.                                                                
                      20  FILLER                  PIC X.                                                                             
                  15  AID-CTD-CHARGES-PC REDEFINES AID-CTD-CHARGES.                                                                  
                      20 AID-CTD-AMT-LATE-CHG-PC PIC S9(7)V99 COMP-3.                                                                
                      20 AID-CTD-AMT-ITEM-CHG-PC PIC S9(7)V99 COMP-3.                                                                
                      20 AID-CTD-DEF-AVE-BAL-PC  PIC S9(7)V99 COMP-3.                                                                
                      20  FILLER                  PIC X.                                                                             
                  15  AID-INTEREST-SEGMENT      COMPUTATIONAL-3.                                                                     
                      20  AID-CAINT-LS-AMT        PIC S9(11)V.                                                                       
                      20  AID-CAINT-LS-RATE       PIC S9(11)V.                                                                       
                      20  AID-CAINT-CTD-AMT       PIC S9(11)V.                                                                       
                      20  AID-CAINT-CTD-RATE      PIC S9(11)V.                                                                       
                      20  AID-MRCHINT-AMT         PIC S9(11)V.                                                                       
                      20  AID-MRCHINT-RATE        PIC S9(11)V.                                                                       
                      20  AID-ILINT-AMT           PIC S9(11)V.                                                                       
                      20  AID-ILINT-RATE          PIC S9(11)V.                                                                       
                  15  AID-INTEREST-SEGMENT-PC       REDEFINES                                                                        
                            AID-INTEREST-SEGMENT  COMPUTATIONAL-3.                                                                   
                      20  AID-CAINT-LS-AMT-PC      PIC S9(7)V9999.                                                                   
                      20  AID-CAINT-LS-RATE-PC     PIC S9(7)V9999.                                                                   
                      20  AID-CAINT-CTD-AMT-PC     PIC S9(7)V9999.                                                                   
                      20  AID-CAINT-CTD-RATE-PC    PIC S9(7)V9999.                                                                   
                      20  AID-MRCHINT-AMT-PC       PIC S9(7)V9999.                                                                   
                      20  AID-MRCHINT-RATE-PC      PIC S9(7)V9999.                                                                   
                      20  AID-ILINT-AMT-PC         PIC S9(7)V9999.                                                                   
                      20  AID-ILINT-RATE-PC        PIC S9(7)V9999.                                                                   
                  15  AID-AGGREGATE-SEGMENT       COMPUTATIONAL-3.                                                                   
                      20  AID-AGG-LOW-OLD-CASH       PIC S9(11)V.                                                                    
                      20  AID-AGG-LOW-NBINT          PIC S9(11)V.                                                                    
                      20  AID-AGG-LOW-BINT           PIC S9(11)V.                                                                    
                      20  AID-AGG-LOW-CYC-CASH       PIC S9(11)V.                                                                    
                      20  AID-AGG-LOW-CYC-MRCH       PIC S9(11)V.                                                                    
                      20  AID-AGG-HIGH-OLD-CASH      PIC S9(11)V.                                                                    
                      20  AID-AGG-TEMP-CASH          PIC S9(11)V.                                                                    
                      20  AID-AGG-HIGH-BINT          PIC S9(11)V.                                                                    
                      20  AID-AGG-HIGH-CYC-CASH      PIC S9(11)V.                                                                    
                      20  AID-AGG-TEMP-MRCH          PIC S9(11)V.                                                                    
                      20  AID-AGG-CYCLE-DAYS         PIC S9(3)V.                                                                     
                  15  AID-AGGREGATE-SEGMENT-PC         REDEFINES                                                                     
                          AID-AGGREGATE-SEGMENT   COMPUTATIONAL-3.                                                                   
                      20  AID-AGG-LOW-OLD-CASH-PC    PIC S9(9)V99.                                                                   
                      20  AID-AGG-LOW-NBINT-PC       PIC S9(9)V99.                                                                   
                      20  AID-AGG-LOW-BINT-PC        PIC S9(9)V99.                                                                   
                      20  AID-AGG-LOW-CYC-CASH-PC    PIC S9(9)V99.                                                                   
                      20  AID-AGG-LOW-CYC-MRCH-PC    PIC S9(9)V99.                                                                   
                      20  AID-AGG-HIGH-OLD-CASH-PC   PIC S9(9)V99.                                                                   
                      20  AID-AGG-TEMP-CASH-PC       PIC S9(9)V99.                                                                   
                      20  AID-AGG-HIGH-BINT-PC       PIC S9(9)V99.                                                                   
                      20  AID-AGG-HIGH-CYC-CASH-PC   PIC S9(9)V99.                                                                   
                      20  AID-AGG-TEMP-MRCH-PC       PIC S9(9)V99.                                                                   
                      20  AID-AGG-CYCLE-DAYS-PC      PIC S9(3)V.                                                                     
                  15  AIDAPPLY-PAYMENT-SEGMENT      COMPUTATIONAL-3.                                                                 
                      20  AIDAP-OPEN-CYC-INTSC          PIC S9(9)V.                                                                  
                      20  AIDAP-OPEN-CYC-IL-INTSC       PIC S9(9)V.                                                                  
                      20  AIDAP-PRINCIPALS.                                                                                          
                          25  AIDAP-OPEN-CYC-CASH-PRIN  PIC S9(9)V.                                                                  
                          25  AIDAP-OPEN-CYC-MRCH-NBINT PIC S9(9)V.                                                                  
                          25  AIDAP-OPEN-CYC-MRCH-BINT  PIC S9(9)V.                                                                  
                          25  AIDAP-CURR-CTD-CASH-PRIN  PIC S9(9)V.                                                                  
                          25  AIDAP-CURR-CTD-MRCH-PRIN  PIC S9(9)V.                                                                  
                          25  AIDAP-OPEN-CYC-LOAN-PRIN  PIC S9(9)V.                                                                  
                  15  AIDAPPLY-PAYMENT-SEGMENT-PC        REDEFINES                                                                   
                         AIDAPPLY-PAYMENT-SEGMENT   COMPUTATIONAL-3.                                                                 
                      20  AIDAP-OPEN-CYC-INTSC-PC      PIC S9(7)V99.                                                                 
                      20  AIDAP-OPEN-CYC-IL-INTSC-PC   PIC S9(7)V99.                                                                 
                      20  AIDAP-PRINCIPALS-PC.                                                                                       
                          25  AIDAP-OPEN-CYC-CASH-PRIN-PC                                                                            
                                                        PIC S9(7)V99.                                                                
                          25  AIDAP-OPEN-CYC-MRCH-NBINT-PC                                                                           
                                                        PIC S9(7)V99.                                                                
                          25  AIDAP-OPEN-CYC-MRCH-BINT-PC                                                                            
                                                        PIC S9(7)V99.                                                                
                          25  AIDAP-CURR-CTD-CASH-PRIN-PC                                                                            
                                                        PIC S9(7)V99.                                                                
                          25  AIDAP-CURR-CTD-MRCH-PRIN-PC                                                                            
                                                        PIC S9(7)V99.                                                                
                          25  AIDAP-OPEN-CYC-LOAN-PRIN-PC                                                                            
                                                        PIC S9(7)V99.                                                                
                  15  AID-TEMP-APPLY-PAY             COMPUTATIONAL-3.                                                                
                      20  AIDTAP-BINT                   PIC S9(9)V.                                                                  
                      20  AIDTAP-CASH                   PIC S9(9)V.                                                                  
                  15  AID-TEMP-APPLY-PAY-PC               REDEFINES                                                                  
                         AID-TEMP-APPLY-PAY          COMPUTATIONAL-3.                                                                
                      20  AIDTAP-BINT-PC               PIC S9(7)V99.                                                                 
                      20  AIDTAP-CASH-PC               PIC S9(7)V99.                                                                 
              10  AID-LAST-STATEMENT.                                                                                                
                  15  AIDLS-BALANCES                COMPUTATIONAL-3.                                                                 
                      20  AID-LAST-STATEMENTED-BAL      PIC S9(9)V.                                                                  
                      20  AID-LS-RC-BAL                 PIC S9(9)V.                                                                  
                      20  AID-LS-IL-BAL                 PIC S9(9)V.                                                                  
                  15  AIDLS-BALANCES-PC  REDEFINES AIDLS-BALANCES                                                                    
                                                     COMPUTATIONAL-3.                                                                
                      20  AID-LAST-STATEMENTED-BAL-PC   PIC S9(7)V99.                                                                
                      20  AID-LS-RC-BAL-PC              PIC S9(7)V99.                                                                
                      20  AID-LS-IL-BAL-PC              PIC S9(7)V99.                                                                
                  15  AIDLS-PRINCIPALS              COMPUTATIONAL-3.                                                                 
                      20  AIDLS-END-CASH                PIC S9(9)V.                                                                  
                      20  AIDLS-END-MRCH-NBINT          PIC S9(9)V.                                                                  
                      20  AIDLS-END-MRCH-BINT           PIC S9(9)V.                                                                  
                      20  AIDLS-CYC-CASH                PIC S9(9)V.                                                                  
                      20  AIDLS-CYC-MRCH                PIC S9(9)V.                                                                  
                      20  AIDLS-END-LOAN                PIC S9(9)V.                                                                  
                  15  AIDLS-PRINCIPALS-PC                 REDEFINES                                                                  
                         AIDLS-PRINCIPALS           COMPUTATIONAL-3.                                                                 
                      20  AIDLS-END-CASH-PC            PIC S9(7)V99.                                                                 
                      20  AIDLS-END-MRCH-NBINT-PC      PIC S9(7)V99.                                                                 
                      20  AIDLS-END-MRCH-BINT-PC       PIC S9(7)V99.                                                                 
                      20  AIDLS-CYC-CASH-PC            PIC S9(7)V99.                                                                 
                      20  AIDLS-CYC-MRCH-PC            PIC S9(7)V99.                                                                 
                      20  AIDLS-END-LOAN-PC            PIC S9(7)V99.                                                                 
                  15  AIDLS-TEMP-PRINS              COMPUTATIONAL-3.                                                                 
                      20  AIDLS-TEMP-BINT              PIC S9(9)V.                                                                   
                      20  AIDLS-TEMP-CASH              PIC S9(9)V.                                                                   
                  15  AIDLS-TEMP-PRINS-PC               REDEFINES                                                                    
                        AIDLS-TEMP-PRINS            COMPUTATIONAL-3.                                                                 
                      20  AIDLS-TEMP-BINT-PC           PIC S9(7)V99.                                                                 
                      20  AIDLS-TEMP-CASH-PC           PIC S9(7)V99.                                                                 
                  15  AIDLS-FINANCE-CHGS            COMPUTATIONAL-3.                                                                 
                      20  AIDLS-UNPAID-INTSC           PIC S9(9)V.                                                                   
                      20  AIDLS-UNPAID-IL-INTSC        PIC S9(9)V.                                                                   
                      20  AIDLS-SVC-CHGS               PIC S9(9)V.                                                                   
                      20  AIDLS-END-CASH-INT           PIC S9(11)V.                                                                  
                      20  AIDLS-CYC-CASH-INT           PIC S9(11)V.                                                                  
                      20  AIDLS-END-MRCH-INT           PIC S9(11)V.                                                                  
                      20  AIDLS-END-LOAN-INT           PIC S9(11)V.                                                                  
                      20  AIDLS-LATE-CHG               PIC S9(9)V.                                                                   
                      20  AIDLS-CR-LIFE-CHG            PIC S9(9)V.                                                                   
                      20  AIDLS-ITEM-CHG               PIC S9(9)V.                                                                   
                      20  AIDLS-CYC-MRCH-CHG           PIC S9(9)V.                                                                   
                      20  AIDLS-MIN-CHG                PIC S9(9)V.                                                                   
                      20  AIDLS-DEF-INT                PIC S9(9)V.                                                                   
                      20  AIDLS-DEF-AVE                PIC S9(9)V.                                                                   
                  15  AIDLS-FINANCE-CHGS-PC              REDEFINES                                                                   
                        AIDLS-FINANCE-CHGS          COMPUTATIONAL-3.                                                                 
                      20  AIDLS-UNPAID-INTSC-PC        PIC S9(7)V99.                                                                 
                      20  AIDLS-UNPAID-IL-INTSC-PC     PIC S9(7)V99.                                                                 
                      20  AIDLS-SVC-CHGS-PC            PIC S9(7)V99.                                                                 
                      20  AIDLS-END-CASH-INT-PC      PIC S9(7)V9999.                                                                 
                      20  AIDLS-CYC-CASH-INT-PC      PIC S9(7)V9999.                                                                 
                      20  AIDLS-END-MRCH-INT-PC      PIC S9(7)V9999.                                                                 
                      20  AIDLS-END-LOAN-INT-PC      PIC S9(7)V9999.                                                                 
                      20  AIDLS-LATE-CHG-PC            PIC S9(7)V99.                                                                 
                      20  AIDLS-CR-LIFE-CHG-PC         PIC S9(7)V99.                                                                 
                      20  AIDLS-ITEM-CHG-PC            PIC S9(7)V99.                                                                 
                      20  AIDLS-CYC-MRCH-CHG-PC        PIC S9(7)V99.                                                                 
                      20  AIDLS-MIN-CHG-PC             PIC S9(7)V99.                                                                 
                      20  AIDLS-DEF-INT-PC             PIC S9(7)V99.                                                                 
                      20  AIDLS-DEF-AVE-PC             PIC S9(7)V99.                                                                 
                  15  AIDLS-PAY-DUE-DATA            COMPUTATIONAL-3.                                                                 
                      20  AIDLS-ACCRUED-ARREARS        PIC S9(9)V.                                                                   
                      20  AIDLS-ACC-RC-ARREARS         PIC S9(9)V.                                                                   
                      20  AIDLS-ACC-IL-ARREARS         PIC S9(9)V.                                                                   
                      20  AIDLS-DEL-1CYC-AMT           PIC S9(9)V.                                                                   
                      20  AIDLS-DEL-2CYC-AMT           PIC S9(9)V.                                                                   
                      20  AIDLS-DEL-3CYC-AMT           PIC S9(9)V.                                                                   
                      20  AIDLS-DEL-4CYC-AMT           PIC S9(9)V.                                                                   
                      20  AIDLS-NO-CYC-DEL             PIC S9V.                                                                      
                      20  AIDLS-BILLED-PAY-DUE         PIC S9(9)V.                                                                   
                      20  AIDLS-RC-BILLED-PAY-DUE      PIC S9(9)V.                                                                   
                      20  AIDLS-IL-BILLED-PAY-DUE      PIC S9(9)V.                                                                   
                      20  AIDLS-PAY-AHEAD-AMT          PIC S9(9)V.                                                                   
                      20  AIDLS-CHGOFF-INDIC           PIC S9(3)V.                                                                   
                  15  AIDLS-PAY-DUE-DATA-PC              REDEFINES                                                                   
                        AIDLS-PAY-DUE-DATA          COMPUTATIONAL-3.                                                                 
                      20  AIDLS-ACCRUED-ARREARS-PC     PIC S9(7)V99.                                                                 
                      20  AIDLS-ACC-RC-ARREARS-PC      PIC S9(7)V99.                                                                 
                      20  AIDLS-ACC-IL-ARREARS-PC      PIC S9(7)V99.                                                                 
                      20  AIDLS-DEL-1CYC-AMT-PC        PIC S9(7)V99.                                                                 
                      20  AIDLS-DEL-2CYC-AMT-PC        PIC S9(7)V99.                                                                 
                      20  AIDLS-DEL-3CYC-AMT-PC        PIC S9(7)V99.                                                                 
                      20  AIDLS-DEL-4CYC-AMT-PC        PIC S9(7)V99.                                                                 
                      20  AIDLS-NO-CYC-DEL-PC          PIC S9V.                                                                      
                      20  AIDLS-BILLED-PAY-DUE-PC      PIC S9(7)V99.                                                                 
                      20  AIDLS-RC-BILLED-PAY-DUE-PC   PIC S9(7)V99.                                                                 
                      20  AIDLS-IL-BILLED-PAY-DUE-PC   PIC S9(7)V99.                                                                 
                      20  AIDLS-PAY-AHEAD-AMT-PC       PIC S9(7)V99.                                                                 
                      20  AIDLS-CHGOFF-INDIC-PC        PIC S9(3)V.                                                                   
              10  AID-PREV-STATEMENT.                                                                                                
                  15  AIDPS-BALANCES                COMPUTATIONAL-3.                                                                 
                      20  AIDPS-BALANCE                PIC S9(9)V.                                                                   
                      20  AIDPS-RC-BAL                 PIC S9(9)V.                                                                   
                      20  AIDPS-IL-BAL                 PIC S9(9)V.                                                                   
                  15  AIDPS-BALANCES-PC REDEFINES AIDPS-BALANCES                                                                     
                                                     COMPUTATIONAL-3.                                                                
                      20  AIDPS-BALANCE-PC             PIC S9(7)V99.                                                                 
                      20  AIDPS-RC-BAL-PC              PIC S9(7)V99.                                                                 
                      20  AIDPS-IL-BAL-PC              PIC S9(7)V99.                                                                 
                  15  AIDPS-PRINCIPALS              COMPUTATIONAL-3.                                                                 
                      20  AIDPS-END-CASH               PIC S9(9)V.                                                                   
                      20  AIDPS-END-MRCH-NBINT         PIC S9(9)V.                                                                   
                      20  AIDPS-END-MRCH-BINT          PIC S9(9)V.                                                                   
                      20  AIDPS-CYC-CASH               PIC S9(9)V.                                                                   
                      20  AIDPS-CYC-MRCH               PIC S9(9)V.                                                                   
                      20  AIDPS-END-LOAN               PIC S9(9)V.                                                                   
                  15  AIDPS-PRINCIPALS-PC                REDEFINES                                                                   
                        AIDPS-PRINCIPALS            COMPUTATIONAL-3.                                                                 
                      20  AIDPS-END-CASH-PC            PIC S9(7)V99.                                                                 
                      20  AIDPS-END-MRCH-NBINT-PC      PIC S9(7)V99.                                                                 
                      20  AIDPS-END-MRCH-BINT-PC       PIC S9(7)V99.                                                                 
                      20  AIDPS-CYC-CASH-PC            PIC S9(7)V99.                                                                 
                      20  AIDPS-CYC-MRCH-PC            PIC S9(7)V99.                                                                 
                      20  AIDPS-END-LOAN-PC            PIC S9(7)V99.                                                                 
                  15  AIDPS-TEMP-PRINS              COMPUTATIONAL-3.                                                                 
                      20  AIDPS-TEMP-BINT              PIC S9(9)V.                                                                   
                      20  AIDPS-TEMP-CASH              PIC S9(9)V.                                                                   
                  15  AIDPS-TEMP-PRINS-PC   REDEFINES                                                                                
                      AIDPS-TEMP-PRINS            COMPUTATIONAL-3.                                                                   
                      20  AIDPS-TEMP-BINT-PC           PIC S9(7)V99.                                                                 
                      20  AIDPS-TEMP-CASH-PC           PIC S9(7)V99.                                                                 
                  15  AIDPS-FINANCE-CHGS            COMPUTATIONAL-3.                                                                 
                      20  AIDPS-UNPAID-INTSC           PIC S9(9)V.                                                                   
                      20  AIDPS-UNPAID-IL-INTSC        PIC S9(9)V.                                                                   
                      20  AIDPS-SVC-CHGS               PIC S9(9)V.                                                                   
                      20  AIDPS-END-CASH-INT           PIC S9(11)V.                                                                  
                      20  AIDPS-CYC-CASH-INT           PIC S9(11)V.                                                                  
                      20  AIDPS-END-MRCH-INT           PIC S9(11)V.                                                                  
                      20  AIDPS-END-LOAN-INT           PIC S9(11)V.                                                                  
                      20  AIDPS-LATE-CHG               PIC S9(9)V.                                                                   
                      20  AIDPS-CR-LIFE-CHG            PIC S9(9)V.                                                                   
                      20  AIDPS-ITEM-CHG               PIC S9(9)V.                                                                   
                      20  AIDPS-CYC-MRCH-CHG           PIC S9(9)V.                                                                   
                      20  AIDPS-MIN-CHG                PIC S9(9)V.                                                                   
                      20  AIDPS-DEF-INT                PIC S9(9)V.                                                                   
                      20  AIDPS-DEF-AVE                PIC S9(9)V.                                                                   
                  15  AIDPS-FINANCE-CHGS-PC              REDEFINES                                                                   
                        AIDPS-FINANCE-CHGS          COMPUTATIONAL-3.                                                                 
                      20  AIDPS-UNPAID-INTSC-PC        PIC S9(7)V99.                                                                 
                      20  AIDPS-UNPAID-IL-INTSC-PC     PIC S9(7)V99.                                                                 
                      20  AIDPS-SVC-CHGS-PC            PIC S9(7)V99.                                                                 
                      20  AIDPS-END-CASH-INT-PC      PIC S9(7)V9999.                                                                 
                      20  AIDPS-CYC-CASH-INT-PC      PIC S9(7)V9999.                                                                 
                      20  AIDPS-END-MRCH-INT-PC      PIC S9(7)V9999.                                                                 
                      20  AIDPS-END-LOAN-INT-PC      PIC S9(7)V9999.                                                                 
                      20  AIDPS-LATE-CHG-PC            PIC S9(7)V99.                                                                 
                      20  AIDPS-CR-LIFE-CHG-PC         PIC S9(7)V99.                                                                 
                      20  AIDPS-ITEM-CHG-PC            PIC S9(7)V99.                                                                 
                      20  AIDPS-CYC-MRCH-CHG-PC        PIC S9(7)V99.                                                                 
                      20  AIDPS-MIN-CHG-PC             PIC S9(7)V99.                                                                 
                      20  AIDPS-DEF-INT-PC             PIC S9(7)V99.                                                                 
                      20  AIDPS-DEF-AVE-PC             PIC S9(7)V99.                                                                 
                  15  AIDPS-PAY-DUE-DATA            COMPUTATIONAL-3.                                                                 
                      20  AIDPS-ACCRUED-ARREARS        PIC S9(9)V.                                                                   
                      20  AIDPS-ACC-RC-ARREARS         PIC S9(9)V.                                                                   
                      20  AIDPS-ACC-IL-ARREARS         PIC S9(9)V.                                                                   
                      20  AIDPS-DEL-1CYC-AMT           PIC S9(9)V.                                                                   
                      20  AIDPS-DEL-2CYC-AMT           PIC S9(9)V.                                                                   
                      20  AIDPS-DEL-3CYC-AMT           PIC S9(9)V.                                                                   
                      20  AIDPS-DEL-4CYC-AMT           PIC S9(9)V.                                                                   
                      20  AIDPS-NO-CYC-DEL             PIC S9V.                                                                      
                      20  AIDPS-BILLED-PAY-DUE         PIC S9(9)V.                                                                   
                      20  AIDPS-RC-BILLED-PAY-DUE      PIC S9(9)V.                                                                   
                      20  AIDPS-IL-BILLED-PAY-DUE      PIC S9(9)V.                                                                   
                      20  AIDPS-PAY-AHEAD-AMT          PIC S9(9)V.                                                                   
                      20  AIDPS-CHGOFF-INDIC           PIC S9(3)V.                                                                   
                  15  AIDPS-PAY-DUE-DATA-PC              REDEFINES                                                                   
                        AIDPS-PAY-DUE-DATA          COMPUTATIONAL-3.                                                                 
                      20  AIDPS-ACCRUED-ARREARS-PC     PIC S9(7)V99.                                                                 
                      20  AIDPS-ACC-RC-ARREARS-PC      PIC S9(7)V99.                                                                 
                      20  AIDPS-ACC-IL-ARREARS-PC      PIC S9(7)V99.                                                                 
                      20  AIDPS-DEL-1CYC-AMT-PC        PIC S9(7)V99.                                                                 
                      20  AIDPS-DEL-2CYC-AMT-PC        PIC S9(7)V99.                                                                 
                      20  AIDPS-DEL-3CYC-AMT-PC        PIC S9(7)V99.                                                                 
                      20  AIDPS-DEL-4CYC-AMT-PC        PIC S9(7)V99.                                                                 
                      20  AIDPS-NO-CYC-DEL-PC          PIC S9V.                                                                      
                      20  AIDPS-BILLED-PAY-DUE-PC      PIC S9(7)V99.                                                                 
                      20  AIDPS-RC-BILLED-PAY-DUE-PC   PIC S9(7)V99.                                                                 
                      20  AIDPS-IL-BILLED-PAY-DUE-PC   PIC S9(7)V99.                                                                 
                      20  AIDPS-PAY-AHEAD-AMT-PC       PIC S9(7)V99.                                                                 
                      20  AIDPS-CHGOFF-INDIC-PC        PIC S9(3)V.                                                                   
              10  AID-ITEM-CHECKPOINTS.                                                                                              
                  15  AID-CTD-ITEM-CHKPTS.                                                                                           
                      20  AID-ICHK-SUB            PIC S9(4)V   COMP.                                                                 
                      20  AID-ITEM-CHKPT OCCURS 15 TIMES.                                                                            
                          25  AID-ICHK-TYPE      PIC S9(2)V   COMP-3.                                                                
                          25  AID-ICHK-RELJUL    PIC S9(3)V   COMP-3.                                                                
                          25  AID-ICHK-AMOUNT    PIC S9(11)V  COMP-3.                                                                
                          25  AID-ICHK-AMOUNT-PC    REDEFINES                                                                        
                               AID-ICHK-AMOUNT   PIC S9(9)V99 COMP-3.                                                                
                  15  FILLER                      PIC X.                                                                             
                  15  AID-LAST-STMT-ITEM-CHKPTS.                                                                                     
                      20  AIDLS-ICHK-SUB          PIC S9(4)V   COMP.                                                                 
                      20  AIDLS-ITEM-CHKPT OCCURS 15 TIMES.                                                                          
                          25  AIDLS-ICHK-TYPE   PIC S9(2)V   COMP-3.                                                                 
                          25  AIDLS-ICHK-RELJUL PIC S9(3)V   COMP-3.                                                                 
                          25  AIDLS-ICHK-AMOUNT PIC S9(11)V  COMP-3.                                                                 
                          25  AIDLS-ICHK-AMOUNT-PC  REDEFINES                                                                        
                               AIDLS-ICHK-AMOUNT  PIC S9(9)V99 COMP-3.                                                               
                  15  FILLER                      PIC X.                                                                             
              10  FILLER                          PIC XX.                                                                            
              10  AID-XFER-DATA            COMPUTATIONAL-3.                                                                          
                  15  AID-CTD-NO-XFER-PUR         PIC S9(3)V.                                                                        
                  15  AID-CTD-NO-XFER-CSH         PIC S9(3)V.                                                                        
                  15  AID-CTD-AMT-XFER-PUR        PIC S9(11)V.                                                                       
                  15  AID-CTD-AMT-XFER-PUR-PC       REDEFINES                                                                        
                        AID-CTD-AMT-XFER-PUR      PIC S9(9)V99.                                                                      
                  15  AID-CTD-AMT-XFER-CSH        PIC S9(11)V.                                                                       
                  15  AID-CTD-AMT-XFER-CSH-PC       REDEFINES                                                                        
                        AID-CTD-AMT-XFER-CSH      PIC S9(9)V99.                                                                      
              10  FILLER                          PIC X(41).                                                                         
                                                                                                                                     
          05  AID-AUTHORIZATION-SEGMENT.                                                                                             
              10  AID-AUTHORIZATION-STATUS         PIC X.                                                                            
              10  FILLER                           PIC X.                                                                            
              10  AID-AUTHORIZATION-SEGMENT-ID     PIC XX.                                                                           
              10  AID-AUTHORIZATION-LENGTH       PIC S9(3)    COMP-3.                                                                
              10  AID-AUTH-TOTAL-AMT             PIC S9(7)V   COMP-3.                                                                
              10  AID-AUTH-CASH-AMT              PIC S9(7)V   COMP-3.                                                                
              10  AID-AUTH-AVAILABLE-CR          PIC S9(7)V   COMP-3.                                                                
              10  AID-AUTH-COUNT-ON-FILE          PIC S9(4)V   COMP.                                                                 
              10  AID-AUTHORIZATION-ENTRY OCCURS 6 TIMES.                                                                            
                  15  AID-AUTH-TYPE               PIC X.                                                                             
                  15  AID-AUTH-DAYS-ON-FILE      PIC S9V      COMP-3.                                                                
                  15  AID-AUTH-AMT-DOLLARS       PIC S9(7)V   COMP-3.                                                                
              10  FILLER                          PIC XX.                                                                            
              10  FILLER                          PIC X(500).                                                                        
                                                                                                                                     
                                                                                                                                     
                                                                                                                                     
          05  AID-DELINQUENCY-SEGMENT.                                                                                               
              10  AID-DELINQUENCY-STATUS           PIC X.                                                                            
              10  FILLER                           PIC X.                                                                            
              10  AID-DELINQUENCY-SEGMENT-ID       PIC XX.                                                                           
              10  AID-DELINQUENCY-LENGTH         PIC S9(3)    COMP-3.                                                                
              10  AID-DELQ-FOR-STMT             COMPUTATIONAL-3.                                                                     
                  15  AID-DEL-AMT-ARREARS         PIC S9(9)V.                                                                        
                  15  AID-DEL-RC-AMT-ARREARS      PIC S9(9)V.                                                                        
                  15  AID-DEL-IL-AMT-ARREARS      PIC S9(9)V.                                                                        
                  15  AID-DEL-1CYC-AMT            PIC S9(9)V.                                                                        
                  15  AID-DEL-2CYC-AMT            PIC S9(9)V.                                                                        
                  15  AID-DEL-3CYC-AMT            PIC S9(9)V.                                                                        
                  15  AID-DEL-4CYC-AMT            PIC S9(9)V.                                                                        
                  15  AID-DEL-NMO-CONT            PIC S9(3)V.                                                                        
                  15  AID-DEL-NO-CYCLES           PIC S9V.                                                                           
                  15  AID-DEL-NO-DAYS             PIC S9(3)V.                                                                        
              10  AID-DELQ-FOR-STMT-PC REDEFINES  AID-DELQ-FOR-STMT                                                                  
                                                COMPUTATIONAL-3.                                                                     
                  15  AID-DEL-AMT-ARREARS-PC      PIC S9(7)V99.                                                                      
                  15  AID-DEL-RC-AMT-ARREARS-PC   PIC S9(7)V99.                                                                      
                  15  AID-DEL-IL-AMT-ARREARS-PC   PIC S9(7)V99.                                                                      
                  15  AID-DEL-1CYC-AMT-PC         PIC S9(7)V99.                                                                      
                  15  AID-DEL-2CYC-AMT-PC         PIC S9(7)V99.                                                                      
                  15  AID-DEL-3CYC-AMT-PC         PIC S9(7)V99.                                                                      
                  15  AID-DEL-4CYC-AMT-PC         PIC S9(7)V99.                                                                      
                  15  AID-DEL-NMO-CONT-PC         PIC S9(3)V.                                                                        
                  15  AID-DEL-NO-CYCLES-PC        PIC S9V.                                                                           
                  15  AID-DEL-NO-DAYS-PC          PIC S9(3)V.                                                                        
              10  FILLER.                                                                                                            
                  15  AID-DEL-MSG-DAYS           PIC S9(3)V   COMP-3.                                                                
                  15  AID-DEL-MSG-CNTL           PIC S9(3)V   COMP-3.                                                                
                  15  AID-DEL-LAST-MSG-DATE      PIC S9(9)V   COMP-3.                                                                
              10  FILLER                          PIC X(500).                                                                        
                                                                                                                                     
                                                                                                                                     
                                                                                                                                     
      01  AID-EXTRACT-DEBIT-CLEAR.                                                                                                   
          05  AID-BASE-SEGMENT-CLR.                                                                                                  
              10  AID-FULL-ACCT-NO-CLR            PIC X(28)                                                                          
                                                  VALUE SPACES.                                                                      
              10  AID-STATUS-BYTES-CLR.                                                                                              
                  15  AID-RECORD-FORMAT-CLR       PIC S9V COMP-3                                                                     
                                                  VALUE ZERO.                                                                        
                  15  AID-STATUS-CODES-CLR       PIC XX VALUE SPACES.                                                                
                  15  AID-GROSS-ACTIVE-CLR        PIC X VALUE SPACES.                                                                
                  15  AID-DEBIT-ACTIVE-CLR        PIC X VALUE SPACES.                                                                
                  15  AID-BASIC-ACTIVE-CLR        PIC X VALUE SPACES.                                                                
                  15  AID-AUTH-FLAG-CLR           PIC X VALUE SPACES.                                                                
                  15  AID-CREDIT-LIFE-FLAG-CLR    PIC X VALUE SPACES.                                                                
                  15  AID-CHARGE-DDA-CODE-CLR     PIC X VALUE SPACES.                                                                
                  15  AID-CYCLE-CODE-CLR          PIC 99 VALUE ZEROS.                                                                
                  15  AID-INTEREST-SWITCH-CLR     PIC X VALUE SPACES.                                                                
                  15  AID-REISSUE-CONTROL-CLR    PIC S9V VALUE ZEROS.                                                                
                  15  AID-RENEWAL-CODE-CLR       PIC S9V VALUE ZEROS.                                                                
                  15  AID-SEX-CODE-CLR            PIC X VALUE SPACES.                                                                
              10  AID-NAME-ADDR-SEGMENT-CLR.                                                                                         
                  15  AID-PRINCIPAL-NAME-CLR      PIC X(26)                                                                          
                                                  VALUE SPACES.                                                                      
                  15  FILLER                      PIC X(57)                                                                          
                                                  VALUE SPACES.                                                                      
              10  AID-INTEREST-RATES-CLR        COMPUTATIONAL-3.                                                                     
                  15  AID-MONTHLY-RATE-CASH-CLR   PIC S9(5)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AID-DAILY-RATE-CASH-CLR     PIC S9(5)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AID-MONTHLY-RATE-CLR        PIC S9(5)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AID-DAILY-RATE-MRCH-CLR     PIC S9(5)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AID-DAILY-RATE-LOAN-CLR     PIC S9(5)V                                                                         
                                                  VALUE ZEROS.                                                                       
              10  AIDOLD-INTEREST-RATES-CLR    COMPUTATIONAL-3.                                                                      
                  15  AIDOLD-DAILY-RATE-CLR        PIC S9(5)V                                                                        
                                                  VALUE ZEROS.                                                                       
                  15  AIDOLD-MONTHLY-RATE-CLR      PIC S9(5)V                                                                        
                                                  VALUE ZEROS.                                                                       
              10  AID-CUST-RELATIONSHIP-CLR       PIC X VALUE SPACES.                                                                
              10  AID-RECOURSE-MERCHANT-CLR       PIC S9(5)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
              10  AID-MISCELLANEOUS-CODES-CLR.                                                                                       
                  15  AID-NO-PLASTICS-CLR         PIC S9(3)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
                  15  AID-CREDIT-LINE-CLR         PIC S9(7)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
                  15  AID-OPEN-DATE-CLR           PIC S9(9)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
                  15  AID-EXPIRATION-DATE-CLR     PIC S9(7)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
                  15  AID-CR-LINE-DATE-CLR        PIC S9(9)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
                  15  AID-CCI-INDICATOR-CLR       PIC X                                                                              
                                                  VALUE SPACES.                                                                      
                  15  AID-EMPLOYEE-FLAG-CLR       PIC X                                                                              
                                                  VALUE SPACES.                                                                      
                  15  AID-RATE-OPTION-CLR         PIC 99                                                                             
                                                  VALUE ZEROS.                                                                       
              10  AID-LAST-RATE-AREA-CLR.                                                                                            
                  15  AID-LAST-RATE-DATE-CLR      PIC S9(7)    COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
                  15  AID-LAST-RATE-OPTION-CLR    PIC 99                                                                             
                                                  VALUE ZEROS.                                                                       
                  15  AID-LAST-ANNUAL-CHARGE-CLR  PIC X                                                                              
                                                  VALUE SPACES.                                                                      
                  15  AID-LAST-INT-METHOD-CLR     PIC 99                                                                             
                                                  VALUE ZEROS.                                                                       
              10  AID-SPECIAL-CODES-CLR           PIC X(8)                                                                           
                                                  VALUE SPACES.                                                                      
              10  AID-DATE-LAST-NONMON-CLR        PIC S9(9)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
              10  AID-DATE-LAST-REVIEW-CLR        PIC S9(9)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
              10  AID-DATE-NEXT-REVIEW-CLR        PIC S9(7)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
              10  AID-NAME-ADDR-CHG-CLR           PIC S9V      COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
              10  AID-TYPE-CRED-LINE-CHG-CLR      PIC X                                                                              
                                                  VALUE SPACES.                                                                      
              10  AID-TYPE-PLASTIC-CLR            PIC X                                                                              
                                                  VALUE SPACES.                                                                      
              10  AID-COLLECTION-CODE-CLR         PIC 99                                                                             
                                                  VALUE ZEROS.                                                                       
              10  AID-COFF-REASON-CODE-CLR        PIC 99                                                                             
                                                  VALUE ZEROS.                                                                       
              10  AID-PAY-AHEAD-FLAG-CLR          PIC S9V      COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
              10  AID-NEWCARD-FLAG-CLR            PIC X                                                                              
                                                  VALUE SPACES.                                                                      
              10  FILLER                          PIC X(47)                                                                          
                                                  VALUE SPACES.                                                                      
              10  AID-LOAN-FIXED-PAYMENT-CLR      PIC S9(9)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
              10  AID-FIXED-PAYMENT-AMT-CLR       PIC S9(9)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
              10  AID-REINSTATED-FLAG-CLR         PIC X                                                                              
                                                  VALUE SPACES.                                                                      
              10  AID-EXTRA-PRSNAL-DATA-CLR.                                                                                         
                  15  AID-DATE-OF-BIRTH-CLR       PIC S9(7)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
                  15  AID-CREDIT-SCORE-CLR        PIC XX                                                                             
                                                  VALUE SPACES.                                                                      
                  15  AID-CR-SCORE-DATE-CLR       PIC S9(9)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
                  15  AID-CHECKING-ACCT-NO-CLR    PIC X(10)                                                                          
                                                  VALUE SPACES.                                                                      
                  15  AID-SAVINGS-ACCT-NO-CLR.                                                                                       
                      20  AID-CRED-ID-CLR         PIC X(6)                                                                           
                                                  VALUE SPACES.                                                                      
                      20  AIDAPPL-SRCE-ID-CLR    PIC S9(7)V   COMP-3                                                                 
                                                  VALUE ZEROS.                                                                       
                  15  AIDAPPROVING-EMPLOYEE-CLR  PIC 9(7)     COMP-3                                                                 
                                                  VALUE ZEROS.                                                                       
                  15  AID-INT-METHOD-CLR          PIC 99                                                                             
                                                  VALUE ZEROS.                                                                       
                  15  AID-SOC-SECURITY-NO-CLR     PIC S9(9)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
                  15  AID-TELEPHONE-AREA-CODE-CLR.                                                                                   
                      20  AID-PHONE-AREA-CODE-CLR PIC S9(3)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
                      20  AID-TELEPHONE-NUM-CLR   PIC X(7)                                                                           
                                                  VALUE SPACES.                                                                      
              10  AID-TRANSIT-ROUTING-NO-CLR      PIC S9(8)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
              10  AID-STMT-HOLD-FLAG-CLR          PIC X                                                                              
                                                  VALUE SPACES.                                                                      
              10  AID-DELETE-FLAG-CLR             PIC X                                                                              
                                                  VALUE SPACES.                                                                      
              10  AID-ANNUAL-CHARGE-FLAG-CLR      PIC X                                                                              
                                                  VALUE SPACES.                                                                      
              10  AID-SEGMENT-BYTE1-CLR           PIC X                                                                              
                                                  VALUE SPACES.                                                                      
              10  AID-SEGMENT-BYTE2-CLR           PIC X                                                                              
                                                  VALUE SPACES.                                                                      
              10  AID-BASE-VERSION-CLR            PIC X                                                                              
                                                  VALUE SPACES.                                                                      
              10  AID-BASE-OFFSET-CLR             PIC 9(4)     COMP                                                                  
                                                  VALUE ZEROS.                                                                       
              10  AID-CYCLES-AT-DELQ-RATE-CLR     PIC 9(2)                                                                           
                                                  VALUE ZEROS.                                                                       
              10  AID-PREV-EXTERNAL-STATUS-CLR    PIC X                                                                              
                                                  VALUE SPACES.                                                                      
              10  AID-PREV-DATE-STATUS-CHG-CLR    PIC S9(9)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
              10  AID-TRANSFER-NEW-ACCT-NO-CLR    PIC X(16)                                                                          
                                                  VALUE SPACES.                                                                      
              10  AID-TRANSFER-OLD-ACCT-NO-CLR    PIC X(16)                                                                          
                                                  VALUE SPACES.                                                                      
              10  AID-LAST-NON-MON-TYPE-CLR       PIC X(3)                                                                           
                                                  VALUE SPACES.                                                                      
              10  AID-LAST-CRD-REQ-DATE-CLR       PIC S9(9)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
              10  AID-LAST-CRD-ISS-DA-CLR         PIC S9(9)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
              10  AID-LAST-ADDR-CHG-DA-CLR        PIC S9(9)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
              10  AID-AIRMILE-PROGRAM-CLR.                                                                                           
                  15  AID-AIRMILE-IND-CLR         PIC X VALUE ' '.                                                                   
                  15  AID-AIRMILE-ENROLL-CLR      PIC S9(9)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
                  15  AID-AIRMILE-CANCEL-CLR      PIC S9(9)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
                  15  AID-AIRMILE-MTD-PTS-CLR     PIC S9(9)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
                  15  AID-AIRMILE-PREV-PTS-CLR    PIC S9(9)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
              10  AID-SKIPPAY-FLAG-CLR            PIC X VALUE ' '.                                                                   
              10  AID-CARD-ACTIVATION-PROMO-CLR.                                                                                     
                  15  AID-CARD-ACT-1-CLR          PIC 9(4) COMP                                                                      
                                                  VALUE ZEROS.                                                                       
                  15  AID-CARD-ACT-2-CLR          PIC 9(4) COMP                                                                      
                                                  VALUE ZEROS.                                                                       
                  15  AID-CARD-ACT-3-CLR          PIC 9(4) COMP                                                                      
                                                  VALUE ZEROS.                                                                       
                  15  AID-CARD-ACT-4-CLR          PIC 9(4) COMP                                                                      
                                                  VALUE ZEROS.                                                                       
                  15  AID-CARD-ACT-5-CLR          PIC 9(4) COMP                                                                      
                                                  VALUE ZEROS.                                                                       
              10  AID-BILL-PAY-TYPE-CLR           PIC X VALUE ' '.                                                                   
              10  AID-PROMO-PRICING-IND-CLR            PIC X                                                                         
                                                  VALUE SPACES.                                                                      
              10  AID-CYCLES-AT-PROMO-RATE-CLR         PIC 9(2)                                                                      
                                                       VALUE ZEROS.                                                                  
              10  AID-PROMO-RATE-OPTION-CLR            PIC 9(2)                                                                      
                                                       VALUE ZEROS.                                                                  
              10  AID-XFER-INTEREST-RATES-CLR    COMPUTATIONAL-3.                                                                    
                  15  AID-MONTHLY-RATE-XFER-CLR        PIC S9(5)V                                                                    
                                                       VALUE ZEROS.                                                                  
                  15  AID-DAILY-RATE-XFER-CLR          PIC S9(5)V                                                                    
                                                       VALUE ZEROS.                                                                  
              10  AID-MRCH-PROMO-RATES-CLR           COMPUTATIONAL-3.                                                                
                  15  AID-MONTHLY-RATE-MRCH-PR-CLR     PIC S9(5)V                                                                    
                                                       VALUE ZEROS.                                                                  
                  15  AID-DAILY-RATE-MRCH-PR-CLR       PIC S9(5)V                                                                    
                                                       VALUE ZEROS.                                                                  
              10  AID-CASH-PROMO-RATES-CLR           COMPUTATIONAL-3.                                                                
                  15  AID-MONTHLY-RATE-CASH-PR-CLR     PIC S9(5)V                                                                    
                                                       VALUE ZEROS.                                                                  
                  15  AID-DAILY-RATE-CASH-PR-CLR       PIC S9(5)V                                                                    
                                                       VALUE ZEROS.                                                                  
              10  AID-XFER-PROMO-RATES-CLR           COMPUTATIONAL-3.                                                                
                  15  AID-MONTHLY-RATE-XFER-PR-CLR     PIC S9(5)V                                                                    
                                                       VALUE ZEROS.                                                                  
                  15  AID-DAILY-RATE-XFER-PR-CLR       PIC S9(5)V                                                                    
                                                       VALUE ZEROS.                                                                  
              10  AID-OVERLMT-IND-CLR             PIC X VALUE ' '.                                                                   
              10  AID-OVERLMT-DATE-CLR            PIC S9(9)V   COMP-3                                                                
                                                       VALUE ZEROS.                                                                  
              10  AID-SC-ORIG-APPL-SRCE-ID-CLR    PIC S9(7)V   COMP-3                                                                
                                                       VALUE ZEROS.                                                                  
              10  AID-SC-ORIG-CREDIT-LINE-CLR     PIC S9(7)V   COMP-3                                                                
                                                       VALUE ZEROS.                                                                  
              10  AID-SC-INTERNAL-SCORE-CLR       PIC X(3)                                                                           
                                                       VALUE SPACES.                                                                 
              10  FILLER                          PIC X(26)                                                                          
                                                       VALUE SPACES.                                                                 
              10  AID-SC-GUARANTOR-SSN-CLR        PIC S9(9)V   COMP-3                                                                
                                                       VALUE ZEROS.                                                                  
              10  AID-SC-GUARANTOR-PHONE-CLR      PIC S9(10)V  COMP-3                                                                
                                                       VALUE ZEROS.                                                                  
              10  AID-SC-GUARANTOR-ADDR1-CLR      PIC X(26)                                                                          
                                                       VALUE SPACES.                                                                 
              10  AID-SC-GUARANTOR-ADDR2-CLR      PIC X(26)                                                                          
                                                       VALUE SPACES.                                                                 
              10  AID-SC-GUARANTOR-CITY-CLR       PIC X(18)                                                                          
                                                       VALUE SPACES.                                                                 
              10  AID-SC-GUARANTOR-STATE-CLR      PIC X(2)                                                                           
                                                       VALUE SPACES.                                                                 
              10  AID-SC-GUARANTOR-ZIP-CLR        PIC 9(5)                                                                           
                                                       VALUE ZEROS.                                                                  
              10  AID-SC-WORK-PHONE-CLR           PIC S9(10)V  COMP-3                                                                
                                                       VALUE ZEROS.                                                                  
              10  AID-LATE-PAYMENT-FLAG-CLR       PIC X VALUE ' '.                                                                   
              10  AID-TYPE-OF-PLASTIC-CLR         PIC X(2)                                                                           
                                                       VALUE SPACES.                                                                 
              10  AID-REWARDS-PROGRAM-CLR.                                                                                           
                  15  AID-REWARDS-IND-CLR         PIC X VALUE ' '.                                                                   
                  15  AID-REWARDS-PGM-TYPE-CLR    PIC X(4)             PS080527                                                      
                                                  VALUE ZEROS.                                                                       
                  15  AID-REWARDS-FEE-AMT-CLR     PIC S9(2)V  COMP-3                                                                 
                                                  VALUE ZEROS.                                                                       
                  15  AID-REWARDS-MKT-CODE-CLR    PIC X(7)                                                                           
                                                  VALUE SPACES.                                                                      
                  15  AID-REWARDS-BONUS-PTS-CLR   PIC S9(4)V  COMP-3                                                                 
                                                  VALUE ZEROS.                                                                       
                  15  AID-REWARDS-ENROLL-CLR      PIC S9(9)V  COMP-3                                                                 
                                                  VALUE ZEROS.                                                                       
                  15  AID-REWARDS-CANCEL-CLR      PIC S9(9)V  COMP-3                                                                 
                                                  VALUE ZEROS.                                                                       
              10  FILLER                          PIC X(4)                                                                           
                                                  VALUE SPACES.                                                                      
              10  AID-MAIDEN-NAME-CLR             PIC X(25)                                                                          
                                                  VALUE SPACES.                                                                      
              10  AID-PROMO-ELIG-DATE-CLR         PIC S9(9)V COMP-3                                                                  
                                                  VALUE ZEROS.                                                                       
              10  AID-PROMO-TARGET-FLAG-CLR       PIC X                                                                              
                                                  VALUE SPACES.                                                                      
              10  AID-GEFA-IDENTITY-TR-CLR.                                                                                          
                  15  AID-GEFA-STATUS-IND-CLR     PIC X(1)                                                                           
                                                  VALUE SPACES.                                                                      
                  15  AID-GEFA-ENROLL-DAT-CLR     PIC S9(9)V COMP-3                                                                  
                                                  VALUE ZEROS.                                                                       
                  15  AID-GEFA-CANCEL-DAT-CLR     PIC S9(9)V COMP-3                                                                  
                                                  VALUE ZEROS.                                                                       
                  15  AID-GEFA-MKTG-CODE-CLR.                                                                                        
                      20  AID-GEFA-MKTG-MM-CLR    PIC X(2)                                                                           
                                                  VALUE SPACES.                                                                      
                      20  AID-GEFA-MKTG-YY-CLR    PIC X(2)                                                                           
                                                  VALUE SPACES.                                                                      
                      20  AID-GEFA-MKTG-CHAN-CLR  PIC X(1)                                                                           
                                                  VALUE SPACES.                                                                      
                      20  AID-GEFA-MKTG-SEG-CLR   PIC X(2)                                                                           
                                                  VALUE SPACES.                                                                      
              10  AID-DO-NOT-SOLICIT-CLR.                                                                                            
                  15  AID-DO-NOT-CALL-CLR         PIC X(1)                                                                           
                                                  VALUE SPACES.                                                                      
                  15  AID-DO-NOT-MAIL-CLR         PIC X(1)                                                                           
                                                  VALUE SPACES.                                                                      
                  15  AID-DO-NOT-SHARE-CLR        PIC X(1)                                                                           
                                                  VALUE SPACES.                                                                      
                  15  AID-DO-NOT-EMAIL-CLR        PIC X(1)                                                                           
                                                  VALUE SPACES.                                                                      
              10  AID-ACCOUNT-RETENTION-CLR       PIC X(1)                                                                           
                                                  VALUE SPACES.                                                                      
              10  FILLER.                                                                                                            
                  15  AID-FIRST6-ACCT-NUM-CLR     PIC X(6)                                                                           
                                                  VALUE SPACES.                                                                      
                  15  AID-LAST4-ACCT-NUM-CLR      PIC X(4)                                                                           
                                                  VALUE SPACES.                                                                      
              10  FILLER                           PIC X(144)                                                                        
                                                  VALUE SPACES.                                                                      
                                                                                                                                     
                                                                                                                                     
          05  AID-HISTORY-SEGMENT-CLR.                                                                                               
              10  FILLER                  PIC X(4)      VALUE SPACES.                                                                
              10  FILLER                  PIC S9(3) COMP-3 VALUE ZEROS.                                                              
              10  AIDHD-VIDEO-DISPLAY-HIST-CLR.                                                                                      
                  15  AIDHD-VD-NMO-ACT-GROSS-CLR  PIC S9(3)V  COMP-3                                                                 
                                                  VALUE ZEROS.                                                                       
                  15  AIDHD-VD-NMO-TOP-LINE-CLR   PIC S9(3)V  COMP-3                                                                 
                                                  VALUE ZEROS.                                                                       
                  15  AIDHD-VD-DELQ-HIST-CLR    COMPUTATIONAL-3.                                                                     
                      20  AIDHD-VD-NMO-DEL-CLR    PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                      20  AIDHD-VD-NO-1CYC-CLR    PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                      20  AIDHD-VD-NO-2CYC-CLR    PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                      20  AIDHD-VD-NO-3CYC-CLR    PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AIDHD-VD-NMO-EARNINGS-CLR   PIC S9(3)V  COMP-3                                                                 
                                                  VALUE ZEROS.                                                                       
                  15  AIDHD-VD-TOTAL-EARN-CLR     PIC S9(11)V COMP-3                                                                 
                                                  VALUE ZEROS.                                                                       
                  15  AIDHD-VD-HIGH-BAL-CLR       PIC S9(7)V  COMP-3                                                                 
                                                  VALUE ZEROS.                                                                       
                  15  AIDHD-VD-HIGH-ARREAR-CLR    PIC S9(7)V  COMP-3                                                                 
                                                  VALUE ZEROS.                                                                       
              10  AIDHD-PREVIOUS-YEAR-CLR       COMPUTATIONAL-3.                                                                     
                  15  AIDHD-PY-NET-NO-PUR-CLR     PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AIDHD-PY-NET-NO-CASH-CLR    PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AIDHD-PY-NET-AMT-PUR-CLR    PIC S9(13)V                                                                        
                                                  VALUE ZEROS.                                                                       
                  15  AIDHD-PY-NET-AMT-CASH-CLR   PIC S9(13)V                                                                        
                                                  VALUE ZEROS.                                                                       
                  15  AIDHD-PY-NMO-ACT-GROSS-CLR  PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AIDHD-PY-NMO-TOP-LINE-CLR   PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AIDHD-PY-DELQ-HIST-CLR.                                                                                        
                      20  AIDHD-PY-NMO-DELIN-CLR  PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                      20  AIDHD-PY-NO-1CYC-D-CLR  PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                      20  AIDHD-PY-NO-2CYC-D-CLR  PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                      20  AIDHD-PY-NO-3CYC-D-CLR  PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AIDHD-PY-NMO-EARN-CLR       PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AIDHD-PY-TOTAL-EARN-CLR     PIC S9(9)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AIDHD-PY-HIGH-BAL-CLR       PIC S9(7)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AIDHD-PY-HIGH-ARR-CLR       PIC S9(7)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AIDHD-PY-NO-LOAN-CLR        PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AIDHD-PY-AMT-LOAN-CLR       PIC S9(13)V                                                                        
                                                  VALUE ZEROS.                                                                       
              10  AIDHD-YEAR-TO-DATE-CLR        COMPUTATIONAL-3.                                                                     
                  15  AIDHD-YTD-NET-NO-PUR-CLR    PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AIDHD-YTD-NET-NO-CAS-CLR    PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AIDHD-YTD-NET-AMT-PUR-CLR   PIC S9(13)V                                                                        
                                                  VALUE ZEROS.                                                                       
                  15  AIDHD-YTD-NET-AMT-CAS-CLR   PIC S9(13)V                                                                        
                                                  VALUE ZEROS.                                                                       
                  15  AIDHD-YTD-NMO-ACT-GRO-CLR   PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AIDHD-YTD-NMO-TOP-LINE-CLR  PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AIDHD-YTD-DELQ-HIST-CLR.                                                                                       
                      20  AIDHD-YTD-NMO-DEL-CLR   PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                      20  AIDHD-YTD-NO-1CYC-DEL-C PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                      20  AIDHD-YTD-NO-2CYC-DEL-C PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                      20  AIDHD-YTD-NO-3CYC-DEL-C PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AIDHD-YTD-NMO-EARN-CLR      PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AIDHD-YTD-HIGH-BAL-CLR      PIC S9(7)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AIDHD-YTD-HIGH-ARR-CLR      PIC S9(7)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AIDHD-YTD-NO-LOAN-CLR       PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AIDHD-YTD-AMT-LOAN-CLR      PIC S9(13)V                                                                        
                                                  VALUE ZEROS.                                                                       
                  15  AIDHD-YTD-BILLED-CASH-INT-C PIC S9(9)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AIDHD-YTD-BILLED-SVC-CHG-C  PIC S9(9)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AIDHD-YTD-BILLED-MRCH-INT-C PIC S9(9)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AIDHD-YTD-BILLED-CR-LIFE-C  PIC S9(9)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AIDHD-YTD-BILLED-LOAN-INT-C PIC S9(9)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AIDHD-YTD-BILLED-LATE-CHG-C PIC S9(9)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AIDHD-YTD-BILLED-ITEM-CHG-C PIC S9(9)V                                                                         
                                                  VALUE ZEROS.                                                                       
              10  AIDHD-LAST-TRAN-DATA-CLR.                                                                                          
                  15  AID-TYPE-LAST-MON-TRAN-C    PIC X VALUE ' '.                                                                   
                  15  AID-DATE-LAST-MON-TRAN-C    PIC S9(9)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
                  15  AID-DATE-LAST-PAYMENT-C     PIC S9(9)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
                  15  AID-DATE-LAST-STMT-C        PIC S9(9)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
                  15  AID-DATE-FIRST-ACT-C        PIC S9(9)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
                  15  AID-DATE-STATUS-CHG-C       PIC S9(9)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
                  15  AID-AMT-LAST-PAYMENT-C      PIC S9(9)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
                  15  AID-DATE-PREV-STM-C         PIC S9(9)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
                  15  AID-CHGOFF-INDI-C           PIC S9(3)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
                  15  AID-HIST-LS-BAL-C           PIC S9(9)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
                  15  AID-HIST-LS-RC-BAL-C        PIC S9(9)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
                  15  AID-HIST-LS-IL-BAL-C        PIC S9(9)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
              10  AID-BONUS-BUCKS-TOT-C           PIC S9(7)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
              10  FILLER                          PIC X VALUE ' '.                                                                   
              10  AID-CURR-NO-REAGED-C            PIC S9(3)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
              10  AID-LAST-NO-REAGED-C            PIC S9(3)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
              10  AID-PREV-NO-REAGED-C            PIC S9(3)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
              10  AIDHD-LY-END-UNPAID-INT-C       PIC S9(9)V  COMP-3                                                                 
                                                  VALUE ZEROS.                                                                       
              10  AIDHD-PY-END-UNPAID-INT-C       PIC S9(9)V  COMP-3                                                                 
                                                  VALUE ZEROS.                                                                       
              10  AID-PAYMENT-HISTORY-PROF-C      PIC X(24)                                                                          
                                                  VALUE SPACES.                                                                      
              10  AIDHD-XFER-HISTORY-DATA-C     COMPUTATIONAL-3.                                                                     
                  15  AIDHD-PY-NET-NO-XFER-P-C    PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AIDHD-PY-NET-AMT-XFER-P-C   PIC S9(13)V                                                                        
                                                  VALUE ZEROS.                                                                       
                  15  AIDHD-YTD-NET-NO-XFER-P-C   PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AIDHD-YTD-NET-AMT-XFER-P-C  PIC S9(13)V                                                                        
                                                  VALUE ZEROS.                                                                       
                  15  AIDHD-YTD-BIL-XFER-MRH-I-C   PIC S9(9)V                                                                        
                                                  VALUE ZEROS.                                                                       
              10  AID-CURR-MTD-TRAN-HIST-C      COMPUTATIONAL-3.                                                                     
                  15  AID-CURR-MTD-NO-SAL-C       PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AID-CURR-MTD-NO-CAS-C       PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AID-CURR-MTD-NO-RET-C       PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AID-CURR-MTD-AMOUNTS-C.                                                                                        
                      20  AID-CURR-MTD-AMT-SAL-C  PIC S9(9)V                                                                         
                                                  VALUE ZEROS.                                                                       
                      20  AID-CURR-MTD-AMT-CAS-C  PIC S9(9)V                                                                         
                                                  VALUE ZEROS.                                                                       
                      20  AID-CURR-MTD-AMT-RET-C  PIC S9(9)V                                                                         
                                                  VALUE ZEROS.                                                                       
              10  AID-LAST-MTD-TRAN-HIST-C      COMPUTATIONAL-3.                                                                     
                  15  AID-LAST-MTD-NO-SAL-C       PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AID-LAST-MTD-NO-CAS-C       PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AID-LAST-MTD-NO-RET-C       PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AID-LAST-MTD-AMT-C.                                                                                            
                      20  AID-LAST-MTD-AMT-SAL-C  PIC S9(9)V                                                                         
                                                  VALUE ZEROS.                                                                       
                      20  AID-LAST-MTD-AMT-CAS-C  PIC S9(9)V                                                                         
                                                  VALUE ZEROS.                                                                       
                      20  AID-LAST-MTD-AMT-RET-C  PIC S9(9)V                                                                         
                                                  VALUE ZEROS.                                                                       
              10  AID-PREV-MTD-TRAN-HIST-C      COMPUTATIONAL-3.                                                                     
                  15  AID-PREV-MTD-NO-SAL-C       PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AID-PREV-MTD-NO-CAS-C       PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AID-PREV-MTD-NO-RET-C       PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AID-PREV-MTD-AMOUNTS-C.                                                                                        
                      20  AID-PREV-MTD-AMT-SAL-C  PIC S9(9)V                                                                         
                                                  VALUE ZEROS.                                                                       
                      20  AID-PREV-MTD-AMT-CAS-C  PIC S9(9)V                                                                         
                                                  VALUE ZEROS.                                                                       
                      20  AID-PREV-MTD-AMT-RET-C  PIC S9(9)V                                                                         
                                                  VALUE ZEROS.                                                                       
              10  AID-FOUR-MTD-TRAN-HIST-C      COMPUTATIONAL-3.                                                                     
                  15  AID-FOUR-MTD-NO-SAL-C       PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AID-FOUR-MTD-NO-CAS-C       PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AID-FOUR-MTD-NO-RET-C       PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AID-FOUR-MTD-AMOUNTS-C.                                                                                        
                      20  AID-FOUR-MTD-AMT-SAL-C  PIC S9(9)V                                                                         
                                                  VALUE ZEROS.                                                                       
                      20  AID-FOUR-MTD-AMT-CAS-C  PIC S9(9)V                                                                         
                                                  VALUE ZEROS.                                                                       
                      20  AID-FOUR-MTD-AMT-RET-C  PIC S9(9)V                                                                         
                                                  VALUE ZEROS.                                                                       
              10  AIDHD-HIGH-PURCH-C              PIC S9(7)V COMP-3                                                                  
                                                  VALUE ZEROS.                                                                       
              10  AIDHD-HIGH-CASH-ADV-C           PIC S9(7)V COMP-3                                                                  
                                                  VALUE ZEROS.                                                                       
              10  AID-CURR-MTD-POST-HIST-C      COMPUTATIONAL-3.                                                                     
                  15  AID-CURR-MTD-NO-PST-SAL-C       PIC S9(3)V                                                                     
                                                  VALUE ZEROS.                                                                       
                  15  AID-CURR-MTD-NO-PST-CAS-C       PIC S9(3)V                                                                     
                                                  VALUE ZEROS.                                                                       
                  15  AID-CURR-MTD-NO-PST-RET-C       PIC S9(3)V                                                                     
                                                  VALUE ZEROS.                                                                       
                  15  AID-CURR-MTD-PST-AMT-C.                                                                                        
                      20  AID-CURR-MTD-AMT-PST-SAL-C  PIC S9(9)V                                                                     
                                                  VALUE ZEROS.                                                                       
                      20  AID-CURR-MTD-AMT-PST-CAS-C  PIC S9(9)V                                                                     
                                                  VALUE ZEROS.                                                                       
                      20  AID-CURR-MTD-AMT-PST-RET-C  PIC S9(9)V                                                                     
                                                  VALUE ZEROS.                                                                       
              10  AID-LAST-MTD-POST-HIST-C      COMPUTATIONAL-3.                                                                     
                  15  AID-LAST-MTD-NO-PST-SAL-C       PIC S9(3)V                                                                     
                                                  VALUE ZEROS.                                                                       
                  15  AID-LAST-MTD-NO-PST-CAS-C       PIC S9(3)V                                                                     
                                                  VALUE ZEROS.                                                                       
                  15  AID-LAST-MTD-NO-PST-RET-C       PIC S9(3)V                                                                     
                                                      VALUE ZEROS.                                                                   
                  15  AID-LAST-MTD-PST-AMT-C.                                                                                        
                      20  AID-LAST-MTD-AMT-PST-SAL-C  PIC S9(9)V                                                                     
                                                      VALUE ZEROS.                                                                   
                      20  AID-LAST-MTD-AMT-PST-CAS-C  PIC S9(9)V                                                                     
                                                      VALUE ZEROS.                                                                   
                      20  AID-LAST-MTD-AMT-PST-RET-C  PIC S9(9)V                                                                     
                                                      VALUE ZEROS.                                                                   
              10  AIDHD-PREVIOUS-YEAR-XFER-C        COMPUTATIONAL-3.                                                                 
                  15  AIDHD-PY-NET-NO-XFER-CSH-C      PIC S9(3)V                                                                     
                                                      VALUE ZEROS.                                                                   
                  15  AIDHD-PY-NET-AMT-XFER-CSH-C     PIC S9(13)V                                                                    
                                                      VALUE ZEROS.                                                                   
              10  AIDHD-YEAR-TO-DATE-XFER-C         COMPUTATIONAL-3.                                                                 
                  15  AIDHD-YTD-NET-NO-XFER-CSH-C        PIC S9(3)V                                                                  
                                                         VALUE ZEROS.                                                                
                  15  AIDHD-YTD-NET-AMT-XFER-CSH-C       PIC S9(13)V                                                                 
                                                         VALUE ZEROS.                                                                
                  15  AIDHD-YTD-BIL-XFER-CSH-INT-C       PIC S9(9)V                                                                  
                                                         VALUE ZEROS.                                                                
              10  AIDHD-YEAR-TO-DATE-PROMO-C        COMPUTATIONAL-3.                                                                 
                  15  AIDHD-YTD-BIL-PROMO-MRH-INT-C      PIC S9(9)V                                                                  
                                                         VALUE ZEROS.                                                                
                  15  AIDHD-YTD-BIL-PROMO-CSH-INT-C      PIC S9(9)V                                                                  
                                                         VALUE ZEROS.                                                                
                  15  AIDHD-YTD-BIL-PROMO-XFR-MIN-C      PIC S9(9)V                                                                  
                                                         VALUE ZEROS.                                                                
                  15  AIDHD-YTD-BIL-PROMO-XFR-CIN-C      PIC S9(9)V                                                                  
                                                         VALUE ZEROS.                                                                
              10  AID-LAST-STATEMENT-PROMO-C         COMPUTATIONAL-3.                                                                
                  15  AID-HIST-LS-PROMO-BAL-C            PIC S9(9)V                                                                  
                                                         VALUE ZEROS.                                                                
              10  AID-LAST-REAGE-DATE-C             PIC S9(9)V COMP-3                                                                
                                                         VALUE ZEROS.                                                                
              10  FILLER                                 PIC X(256)                                                                  
                                                         VALUE SPACES.                                                               
                                                                                                                                     
                                                                                                                                     
          05  AID-ACTIVITY-SEGMENT-C.                                                                                                
              10  FILLER                  PIC X(4)    VALUE SPACES.                                                                  
              10  FILLER                  PIC S9(3)   VALUE +0  COMP-3.                                                              
              10  AID-CURR-CTD-ACTIVITY-C.                                                                                           
                  15  AID-CURRENT-BALANCE-C       PIC S9(11)V  COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
                  15  AID-CURR-RC-BAL-C           PIC S9(11)V  COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
                  15  AID-CURR-IL-BAL-C           PIC S9(11)V  COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
                  15  AID-CURR-IL-BAL-C           PIC S9(11)V  COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
                  15  AID-OVERPAYMENT-AMT-C       PIC S9(9)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
                  15  AID-CYCLE-TO-DATE-DATA-C       COMPUTATIONAL-3.                                                                
                      20  AID-CTD-COUNTS-AMTS-C.                                                                                     
                          25  AID-CTD-NO-SALE-C           PIC S9(3)V                                                                 
                                                          VALUE ZEROS.                                                               
                          25  AID-CTD-NO-CASH-C           PIC S9(3)V                                                                 
                                                          VALUE ZEROS.                                                               
                          25  AID-CTD-NO-RETURN-C         PIC S9(3)V                                                                 
                                                          VALUE ZEROS.                                                               
                          25  AID-CTD-NO-PAYMENT-C        PIC S9(3)V                                                                 
                                                          VALUE ZEROS.                                                               
                          25  AID-CTD-NO-LOAN-C           PIC S9(3)V                                                                 
                                                          VALUE ZEROS.                                                               
                          25  AID-CTD-NO-ADJ-C            PIC S9(3)V                                                                 
                                                          VALUE ZEROS.                                                               
                          25  AID-CTD-AMOUNTS-C.                                                                                     
                              30  AID-CTD-AMT-SALE-C      PIC S9(11)V                                                                
                                                          VALUE ZEROS.                                                               
                              30  AID-CTD-AMT-CASH-C      PIC S9(11)V                                                                
                                                          VALUE ZEROS.                                                               
                              30  AID-CTD-AMT-RETURN-C    PIC S9(11)V                                                                
                                                          VALUE ZEROS.                                                               
                              30  AID-CTD-AMT-PAYMEN-C    PIC S9(11)V                                                                
                                                          VALUE ZEROS.                                                               
                              30  AID-CTD-AMT-LOAN-C      PIC S9(11)V                                                                
                                                          VALUE ZEROS.                                                               
                      20  AID-CTD-UNPAID-BPDS-C.                                                                                     
                          25  AID-CTD-UNPAID-RC-BPD-C     PIC S9(9)V                                                                 
                                                          VALUE ZEROS.                                                               
                          25  AID-CTD-UNPAID-IL-BPD-C     PIC S9(9)V                                                                 
                                                          VALUE ZEROS.                                                               
                          25  AID-CTD-PAY-AHEAD-AMT-C     PIC S9(9)V                                                                 
                                                          VALUE ZEROS.                                                               
                  15  AID-CTD-CHARGES-C.                                                                                             
                      20  AID-CTD-AMT-LATE-CHG-C  PIC S9(9)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
                      20  AID-CTD-AMT-ITEM-CHG-C  PIC S9(9)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
                      20  AID-CTD-DEF-AVE-BAL-C   PIC S9(9)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
                      20  FILLER                  PIC X VALUE ' '.                                                                   
                  15  AID-INTEREST-SEGMENT-C    COMPUTATIONAL-3.                                                                     
                      20  AID-CAINT-LS-AMT-C      PIC S9(11)V                                                                        
                                                  VALUE ZEROS.                                                                       
                      20  AID-CAINT-LS-RATE-C     PIC S9(11)V                                                                        
                                                  VALUE ZEROS.                                                                       
                      20  AID-CAINT-CTD-AMT-C     PIC S9(11)V                                                                        
                                                  VALUE ZEROS.                                                                       
                      20  AID-CAINT-CTD-RATE-C    PIC S9(11)V                                                                        
                                                  VALUE ZEROS.                                                                       
                      20  AID-MRCHINT-AMT-C       PIC S9(11)V                                                                        
                                                  VALUE ZEROS.                                                                       
                      20  AID-MRCHINT-RATE-C      PIC S9(11)V                                                                        
                                                  VALUE ZEROS.                                                                       
                      20  AID-ILINT-AMT-C         PIC S9(11)V                                                                        
                                                  VALUE ZEROS.                                                                       
                      20  AID-ILINT-RATE-C        PIC S9(11)V                                                                        
                                                  VALUE ZEROS.                                                                       
                  15  AID-AGGREGATE-SEGMENT-C     COMPUTATIONAL-3.                                                                   
                      20  AID-AGG-LOW-OLD-CASH-C     PIC S9(11)V                                                                     
                                                     VALUE ZEROS.                                                                    
                      20  AID-AGG-LOW-NBINT-C        PIC S9(11)V                                                                     
                                                     VALUE ZEROS.                                                                    
                      20  AID-AGG-LOW-BINT-C         PIC S9(11)V                                                                     
                                                     VALUE ZEROS.                                                                    
                      20  AID-AGG-LOW-CYC-CASH-C     PIC S9(11)V                                                                     
                                                     VALUE ZEROS.                                                                    
                      20  AID-AGG-LOW-CYC-MRCH-C     PIC S9(11)V                                                                     
                                                     VALUE ZEROS.                                                                    
                      20  AID-AGG-HIGH-OLD-CASH-C    PIC S9(11)V                                                                     
                                                     VALUE ZEROS.                                                                    
                      20  AID-AGG-TEMP-CASH-C        PIC S9(11)V                                                                     
                                                     VALUE ZEROS.                                                                    
                      20  AID-AGG-HIGH-BINT-C        PIC S9(11)V                                                                     
                                                     VALUE ZEROS.                                                                    
                      20  AID-AGG-HIGH-CYC-CASH-C    PIC S9(11)V                                                                     
                                                     VALUE ZEROS.                                                                    
                      20  AID-AGG-TEMP-MRCH-C        PIC S9(11)V                                                                     
                                                     VALUE ZEROS.                                                                    
                      20  AID-AGG-CYCLE-DAYS-C       PIC S9(3)V                                                                      
                                                     VALUE ZEROS.                                                                    
                  15  AIDAPPLY-PAYMENT-SEGMENT-C    COMPUTATIONAL-3.                                                                 
                      20  AIDAP-OPEN-CYC-INTSC-C        PIC S9(9)V                                                                   
                                                        VALUE ZEROS.                                                                 
                      20  AIDAP-OPEN-CYC-IL-INTSC-C     PIC S9(9)V                                                                   
                                                        VALUE ZEROS.                                                                 
                      20  AIDAP-PRINCIPALS-C.                                                                                        
                          25  AIDAP-OPEN-CYC-CASH-PR-C  PIC S9(9)V                                                                   
                                                        VALUE ZEROS.                                                                 
                          25  AIDAP-OPEN-CYC-MRCH-NB-C  PIC S9(9)V                                                                   
                                                        VALUE ZEROS.                                                                 
                          25  AIDAP-OPEN-CYC-MRCH-BI-C  PIC S9(9)V                                                                   
                                                        VALUE ZEROS.                                                                 
                          25  AIDAP-CURR-CTD-CASH-PR-C  PIC S9(9)V                                                                   
                                                        VALUE ZEROS.                                                                 
                          25  AIDAP-CURR-CTD-MRCH-PR-C  PIC S9(9)V                                                                   
                                                        VALUE ZEROS.                                                                 
                          25  AIDAP-OPEN-CYC-LOAN-PR-C  PIC S9(9)V                                                                   
                                                        VALUE ZEROS.                                                                 
                  15  AID-TEMP-APPLY-PAY-C           COMPUTATIONAL-3.                                                                
                      20  AIDTAP-BINT-C                 PIC S9(9)V                                                                   
                                                        VALUE ZEROS.                                                                 
                      20  AIDTAP-CASH-C                 PIC S9(9)V                                                                   
                                                        VALUE ZEROS.                                                                 
              10  AID-LAST-STATEMENT-C.                                                                                              
                  15  AIDLS-BALANCES-C              COMPUTATIONAL-3.                                                                 
                      20  AID-LAST-STATEMENTED-BAL-C    PIC S9(9)V                                                                   
                                                        VALUE ZEROS.                                                                 
                      20  AIDLS-RC-BAL-C               PIC S9(9)V                                                                    
                                                        VALUE ZEROS.                                                                 
                      20  AIDLS-IL-BAL-C               PIC S9(9)V                                                                    
                                                        VALUE ZEROS.                                                                 
                  15  AIDLS-PRINCIPALS-C            COMPUTATIONAL-3.                                                                 
                      20  AIDLS-END-CASH-C              PIC S9(9)V                                                                   
                                                        VALUE ZEROS.                                                                 
                      20  AIDLS-END-MRCH-NBINT-C        PIC S9(9)V                                                                   
                                                        VALUE ZEROS.                                                                 
                      20  AIDLS-END-MRCH-BINT-C         PIC S9(9)V                                                                   
                                                        VALUE ZEROS.                                                                 
                      20  AIDLS-CYC-CASH-C              PIC S9(9)V                                                                   
                                                        VALUE ZEROS.                                                                 
                      20  AIDLS-CYC-MRCH-C              PIC S9(9)V                                                                   
                                                        VALUE ZEROS.                                                                 
                      20  AIDLS-END-LOAN-C              PIC S9(9)V                                                                   
                                                        VALUE ZEROS.                                                                 
                  15  AIDLS-TEMP-PRINS-C            COMPUTATIONAL-3.                                                                 
                      20  AIDLS-TEMP-BINT-C            PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDLS-TEMP-CASH-C            PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                  15  AIDLS-FINANCE-CHGS-C          COMPUTATIONAL-3.                                                                 
                      20  AIDLS-UNPAID-INTS-C          PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDLS-UNPAID-IL-INTS-C       PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDLS-SVC-CHGS-C             PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDLS-END-CASH-INT-C         PIC S9(11)V                                                                   
                                                       VALUE ZEROS.                                                                  
                      20  AIDLS-CYC-CASH-INT-C         PIC S9(11)V                                                                   
                                                       VALUE ZEROS.                                                                  
                      20  AIDLS-END-MRCH-INT-C         PIC S9(11)V                                                                   
                                                       VALUE ZEROS.                                                                  
                      20  AIDLS-END-LOAN-INT-C         PIC S9(11)V                                                                   
                                                       VALUE ZEROS.                                                                  
                      20  AIDLS-LATE-CHG-C             PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDLS-CR-LIFE-CHG-C          PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDLS-ITEM-CHG-C             PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDLS-CYC-MRCH-CHG-C         PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDLS-MIN-CHG-C              PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDLS-DEF-INT-C              PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDLS-DEF-AVE-C              PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                  15  AIDLS-PAY-DUE-DATA-C          COMPUTATIONAL-3.                                                                 
                      20  AIDLS-ACCRUED-ARREARS-C      PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDLS-ACC-RC-ARREARS-C       PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDLS-ACC-IL-ARREARS-C       PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDLS-DEL-1CYC-AMT-C         PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDLS-DEL-2CYC-AMT-C         PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDLS-DEL-3CYC-AMT-C         PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDLS-DEL-4CYC-AMT-C         PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDLS-NO-CYC-DEL-C           PIC S9V                                                                       
                                                       VALUE ZEROS.                                                                  
                      20  AIDLS-BILLED-PAY-DUE-C       PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDLS-RC-BILLED-PAY-DUE-C    PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDLS-IL-BILLED-PAY-DUE-C    PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDLS-PAY-AHEAD-AMT-C        PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDLS-CHGOFF-INDIC-C         PIC S9(3)V                                                                    
                                                       VALUE ZEROS.                                                                  
              10  AID-PREV-STATEMENT-C.                                                                                              
                  15  AIDPS-BALANCES-C              COMPUTATIONAL-3.                                                                 
                      20  AIDPS-BALANCE-C              PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDPS-RC-BAL-C               PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDPS-IL-BAL-C               PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                  15  AIDPS-PRINCIPALS-C            COMPUTATIONAL-3.                                                                 
                      20  AIDPS-END-CASH-C             PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDPS-END-MRCH-NBINT-C       PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDPS-END-MRCH-BINT-C        PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDPS-CYC-CASH-C             PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDPS-CYC-MRCH-C             PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDPS-END-LOAN-C             PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                  15  AIDPS-TEMP-PRINS-C            COMPUTATIONAL-3.                                                                 
                      20  AIDPS-TEMP-BINT-C            PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDPS-TEMP-CASH-C            PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                  15  AIDPS-FINANCE-CHGS            COMPUTATIONAL-3.                                                                 
                      20  AIDPS-UNPAID-INTSC-C         PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDPS-UNPAID-IL-INTSC-C      PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDPS-SVC-CHGS-C             PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDPS-END-CASH-INT-C         PIC S9(11)V                                                                   
                                                       VALUE ZEROS.                                                                  
                      20  AIDPS-CYC-CASH-INT-C         PIC S9(11)V                                                                   
                                                       VALUE ZEROS.                                                                  
                      20  AIDPS-END-MRCH-INT-C         PIC S9(11)V                                                                   
                                                       VALUE ZEROS.                                                                  
                      20  AIDPS-END-LOAN-INT-C         PIC S9(11)V                                                                   
                                                       VALUE ZEROS.                                                                  
                      20  AIDPS-LATE-CHG-C             PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDPS-CR-LIFE-CHG-C          PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDPS-ITEM-CHG-C             PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDPS-CYC-MRCH-CHG-C         PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDPS-MIN-CHG-C              PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDPS-DEF-INT-C              PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDPS-DEF-AVE-C              PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                  15  AIDPS-PAY-DUE-DATA-C          COMPUTATIONAL-3.                                                                 
                      20  AIDPS-ACCRUED-ARREARS-C      PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDPS-ACC-RC-ARREARS-C       PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDPS-ACC-IL-ARREARS-C       PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDPS-DEL-1CYC-AMT-C         PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDPS-DEL-2CYC-AMT-C         PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDPS-DEL-3CYC-AMT-C         PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDPS-DEL-4CYC-AMT-C         PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDPS-NO-CYC-DEL-C           PIC S9V                                                                       
                                                       VALUE ZEROS.                                                                  
                      20  AIDPS-BILLED-PAY-DUE-C       PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDPS-RC-BILLED-PAY-DUE-C    PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDPS-IL-BILLED-PAY-DUE-C    PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDPS-PAY-AHEAD-AMT-C        PIC S9(9)V                                                                    
                                                       VALUE ZEROS.                                                                  
                      20  AIDPS-CHGOFF-INDIC-C         PIC S9(3)V                                                                    
                                                       VALUE ZEROS.                                                                  
              10  AID-ITEM-CHECKPOINTS-C.                                                                                            
                  15  AID-CTD-ITEM-CHKPTS-C.                                                                                         
                      20  AID-ICHK-SUB-C          PIC S9(4)V   COMP                                                                  
                                                  VALUE ZEROS.                                                                       
                      20  AID-ITEM-CHKPT-C OCCURS 15 TIMES.                                                                          
                          25  AID-ICHK-TYPE-C     PIC S9(2)V  COMP-3.                                                                
                          25  AID-ICHK-RELJUL-C   PIC S9(3)V  COMP-3.                                                                
                          25  AID-ICHK-AMOUNT-C   PIC S9(11)V COMP-3.                                                                
                  15  FILLER                      PIC X VALUE ' '.                                                                   
                  15  AID-LAST-STMT-ITEM-CHKPTS-C.                                                                                   
                      20  AIDLS-ICHK-SUB-C        PIC S9(4)V   COMP                                                                  
                                                  VALUE ZEROS.                                                                       
                      20  AIDLS-ITEM-CHKPT-C OCCURS 15 TIMES.                                                                        
                          25  AIDLS-ICHK-TYPE-C   PIC S9(2)V COMP-3.                                                                 
                          25  AIDLS-ICHK-RELJUL-C PIC S9(3)V COMP-3.                                                                 
                          25 AIDLS-ICHK-AMOUNT-C PIC S9(11)V COMP-3.                                                                 
              10  FILLER                          PIC X(3)                                                                           
                                                  VALUE SPACES.                                                                      
              10  AID-XFER-DATA-C          COMPUTATIONAL-3.                                                                          
                  15  AID-CTD-NO-XFER-PUR-C       PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AID-CTD-NO-XFER-CSH-C       PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AID-CTD-AMT-XFER-PUR-C      PIC S9(11)V                                                                        
                                                  VALUE ZEROS.                                                                       
                  15  AID-CTD-AMT-XFER-CSH-C      PIC S9(11)V                                                                        
                                                  VALUE ZEROS.                                                                       
              10  FILLER                          PIC X(41)                                                                          
                                                  VALUE SPACES.                                                                      
                                                                                                                                     
          05  AID-AUTHORIZATION-SEGMENT-C.                                                                                           
              10  FILLER                  PIC X(4)    VALUE SPACES.                                                                  
              10  FILLER                  PIC S9(3)   VALUE +0  COMP-3.                                                              
              10  AID-AUTH-TOTAL-AMT-C            PIC S9(7)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
              10  AID-AUTH-CASH-AMT-C             PIC S9(7)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
              10  AID-AUTH-AVAILABLE-CR-C         PIC S9(7)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
              10  AID-AUTH-COUNT-ON-FILE-C        PIC S9(4)V   COMP                                                                  
                                                  VALUE ZEROS.                                                                       
              10  AID-AUTHORIZATION-ENTRY-C OCCURS 6 TIMES.                                                                          
                  15  AID-AUTH-TYPE-C             PIC X.                                                                             
                  15  AID-AUTH-DAYS-ON-FILE-C     PIC S9V     COMP-3.                                                                
                  15  AID-AUTH-AMT-DOLLARS-C      PIC S9(7)V  COMP-3.                                                                
              10  FILLER                          PIC X(502)                                                                         
                                                  VALUE SPACES.                                                                      
                                                                                                                                     
                                                                                                                                     
          05  AID-DELINQUENCY-SEGMENT-C.                                                                                             
              10  FILLER                  PIC X(4)    VALUE SPACES.                                                                  
              10  FILLER                  PIC S9(3)   VALUE +0  COMP-3.                                                              
              10  AID-DELQ-FOR-STMT-C           COMPUTATIONAL-3.                                                                     
                  15  AID-DEL-AMT-ARREARS-C       PIC S9(9)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AID-DEL-RC-AMT-ARREARS-C    PIC S9(9)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AID-DEL-IL-AMT-ARREARS-C    PIC S9(9)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AID-DEL-1CYC-AMT-C          PIC S9(9)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AID-DEL-2CYC-AMT-C          PIC S9(9)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AID-DEL-3CYC-AMT-C          PIC S9(9)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AID-DEL-4CYC-AMT-C          PIC S9(9)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AID-DEL-NMO-CONT-C          PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
                  15  AID-DEL-NO-CYCLES-C         PIC S9V                                                                            
                                                  VALUE ZEROS.                                                                       
                  15  AID-DEL-NO-DAYS-C           PIC S9(3)V                                                                         
                                                  VALUE ZEROS.                                                                       
              10  FILLER.                                                                                                            
                  15  AID-DEL-MSG-DAYS-C          PIC S9(3)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
                  15  AID-DEL-MSG-CNTL-C          PIC S9(3)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
                  15  AID-DEL-LAST-MSG-DATE-C     PIC S9(9)V   COMP-3                                                                
                                                  VALUE ZEROS.                                                                       
              10  FILLER                          PIC X(500)                                                                         
                                                  VALUE SPACES.                                                                      
                                                                                                                                     
                                                                                                                                     
-